{
    "rules": [
        {
            "rule_id": "hr_salary_delay",
            "domain": "Workplace",
            "topic": "Salary",
            "summary": "Employer cannot delay salary without notice.",
            "verdict": "CANNOT",
            "conditions": [
                "Wages must be paid by the 7th-10th of the following month (Payment of Wages Act)."
            ],
            "exceptions": [
                "Companies with < 1,000 employees can pay by the 7th; others by the 10th.",
                "Written agreement for different cycle (rare exceptions)."
            ],
            "simple_explanation": "Your employer must pay your salary on time, usually by the 7th or 10th of the month. They cannot simply delay it without a valid reason and prior notice.",
            "detailed_explanation": "Under the Payment of Wages Act, 1936, employers are legally bound to pay wages on time. Deductions or delays are only permitted for specific reasons like authorized absence, and must be communicated.",
            "examples": [
                "Boss says 'money is tight' and holds salary for 2 months.",
                "Salary is consistently paid on the 20th without agreement."
            ],
            "what_to_say": "I understand the situation, but my financial commitments rely on my salary being paid by the 7th as per the Payment of Wages Act. Please confirm when it will be credited.",
            "source_category": "Payment of Wages Act, 1936"
        },
        {
            "rule_id": "hr_unpaid_overtime",
            "domain": "Workplace",
            "topic": "Overtime",
            "summary": "Unpaid overtime is generally not allowed for eligible employees.",
            "verdict": "CANNOT",
            "conditions": [
                "Work beyond 9 hours/day or 48 hours/week usually requires 2x pay (Factories Act/Shops Act).",
                "Applies to 'workmen' or non-managerial roles mostly."
            ],
            "exceptions": [
                "Managerial or Administrative roles often have different contracts.",
                "Startups with specific employment agreements (though laws still apply)."
            ],
            "simple_explanation": "If you are working beyond your shift hours, you are generally entitled to overtime pay or compensatory off, unless your contract specifically excludes it for your role.",
            "detailed_explanation": "The Minimum Wages Act and Shops & Establishments Act mandate overtime payment at double the normal rate for work exceeding standard hours. 'Managerial' exemptions are often misused.",
            "examples": [
                "Boss asks you to stay late every day without extra pay.",
                "Working weekends typically requires a 'Comp-off' or overtime pay."
            ],
            "what_to_say": "I am happy to support the team, but these extra hours are significant. Can we discuss overtime pay or compensatory off for this time?",
            "source_category": "Minimum Wages Act, 1948"
        },
        {
            "rule_id": "hr_forced_resignation",
            "domain": "Workplace",
            "topic": "Termination",
            "summary": "Employers cannot force you to resign.",
            "verdict": "CANNOT",
            "conditions": [
                "Forced resignation is legally treated as illegal termination.",
                "You have the right to refuse to sign."
            ],
            "exceptions": [
                "If you are being terminated for proven gross misconduct (with inquiry)."
            ],
            "simple_explanation": "Your boss cannot force you to write a resignation letter. If they want to fire you, they must give you a termination letter, which usually requires severance or notice pay.",
            "detailed_explanation": "Companies often force resignation to avoid paying retrenchment compensation or to hide firing statistics. This is illegal under the Industrial Disputes Act.",
            "examples": [
                "HR calls you into a room and demands you sign a resignation letter immediately."
            ],
            "what_to_say": "I am not resigning. If the company wishes to terminate my employment, please provide a formal termination letter stating the reasons.",
            "source_category": "Industrial Disputes Act, 1947"
        },
        {
            "rule_id": "hr_bond_enforcement",
            "domain": "Workplace",
            "topic": "Bond",
            "summary": "Employment bonds are only valid for training costs.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Employer must prove they spent money on your specific training.",
                "Bond amount must be reasonable and proportionate to the loss."
            ],
            "exceptions": [
                "Generic 'onboarding' costs do not count.",
                "Bonds cannot be used to force you to stay against your will (forced labor)."
            ],
            "simple_explanation": "A bond is only valid if the company spent actual money on your specialized training. They cannot demand a huge random amount just for leaving.",
            "detailed_explanation": "Section 27 of the Indian Contract Act voids agreements in restraint of trade. Courts only allow recovery of 'actual training expenses', not penalties.",
            "examples": [
                "Company asks for ₹2 Lakhs for leaving, but gave no training."
            ],
            "what_to_say": "I am willing to reimburse the actual cost of training provided to me. Please share the breakdown of these specific expenses.",
            "source_category": "Indian Contract Act, 1872"
        },
        {
            "rule_id": "hr_experience_letter",
            "domain": "Workplace",
            "topic": "Termination",
            "summary": "Employer cannot withhold your Experience Letter.",
            "verdict": "CANNOT",
            "conditions": [
                "You have served the notice period or paid in lieu of it.",
                "No pending dues from your side."
            ],
            "exceptions": [
                "If you absconded without notice."
            ],
            "simple_explanation": "If you have resigned properly and served your notice, the company must provide an Experience/Relieving letter. They cannot hold it hostage.",
            "detailed_explanation": "Withholding service certificates restricts an employee's right to profession (Article 19(1)(g)). Courts have ruled that employers are duty-bound to issue these.",
            "examples": [
                "HR says they won't give relieving letter until you sign a non-compete."
            ],
            "what_to_say": "I have completed my exit formalities. Withholding my experience letter is legally untenable. Please release it immediately.",
            "source_category": "Industrial Disputes Act / Shops Act"
        },
        {
            "rule_id": "hr_maternity_leave",
            "domain": "Workplace",
            "topic": "Maternity",
            "summary": "Female employees are entitled to 26 weeks of maternity leave.",
            "verdict": "CAN",
            "conditions": [
                "For first two children: 26 weeks (8 weeks can be before delivery).",
                "For third child onwards: 12 weeks.",
                "Applies to establishments with 10+ employees."
            ],
            "exceptions": [
                "Employers can ask for proof of pregnancy.",
                "Work-from-home option can be offered after initial leave."
            ],
            "simple_explanation": "You have the legal right to take paid maternity leave for 26 weeks. Your employer cannot fire you or deny this benefit.",
            "detailed_explanation": "The Maternity Benefit Act, 1961 (amended 2017) mandates paid leave. Employers who deny this face penalties and compensation orders.",
            "examples": [
                "Boss says 'We can only give you one month off'.",
                "Company threatens to terminate during pregnancy."
            ],
            "what_to_say": "As per the Maternity Benefit Act, I am entitled to 26 weeks of paid leave. Please confirm the process for formally applying.",
            "source_category": "Maternity Benefit Act, 1961"
        },
        {
            "rule_id": "hr_sexual_harassment",
            "domain": "Workplace",
            "topic": "Harassment",
            "summary": "Employers must have a POSH committee and cannot ignore complaints.",
            "verdict": "CANNOT",
            "conditions": [
                "All workplaces with 10+ employees must have Internal Complaints Committee.",
                "Complaints must be investigated within 90 days."
            ],
            "exceptions": [
                "False/malicious complaints can lead to action against complainant."
            ],
            "simple_explanation": "If you face sexual harassment at work, your company is legally required to investigate. They cannot dismiss your complaint or retaliate against you.",
            "detailed_explanation": "The POSH Act (Sexual Harassment of Women at Workplace Act, 2013) mandates strict procedures. Retaliation is a criminal offense.",
            "examples": [
                "Manager makes inappropriate comments, HR ignores complaint.",
                "Company says 'just ignore him' without inquiry."
            ],
            "what_to_say": "I would like to file a formal complaint under the POSH Act. Please direct me to the Internal Complaints Committee.",
            "source_category": "POSH Act, 2013"
        },
        {
            "rule_id": "hr_pf_mandatory",
            "domain": "Workplace",
            "topic": "Gratuity",
            "summary": "PF and Gratuity are mandatory for eligible employees.",
            "verdict": "CANNOT",
            "conditions": [
                "PF is mandatory for organizations with 20+ employees.",
                "Gratuity is due after 5 years of service.",
                "Both employee and employer contribute to PF (12% each)."
            ],
            "exceptions": [
                "Some government exemptions exist for certain sectors."
            ],
            "simple_explanation": "Your employer cannot refuse to enroll you in PF or deny gratuity after 5 years. These are statutory benefits.",
            "detailed_explanation": "The Employees' Provident Fund Act and Payment of Gratuity Act make these benefits mandatory. Non-compliance invites legal action.",
            "examples": [
                "Company says 'We don't provide PF for contract workers'.",
                "Employer refuses gratuity saying you resigned."
            ],
            "what_to_say": "PF enrollment is mandatory under the EPF Act. Please initiate my registration immediately.",
            "source_category": "EPF Act / Payment of Gratuity Act"
        },
        {
            "rule_id": "hr_notice_period",
            "domain": "Workplace",
            "topic": "Resignation",
            "summary": "Notice period must be mutual and reasonable.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Standard notice is 1-3 months as per contract.",
                "Employer cannot have different notice periods for employee vs company."
            ],
            "exceptions": [
                "You can negotiate buyout of notice period.",
                "Summary dismissal for gross misconduct doesn't require notice."
            ],
            "simple_explanation": "You must serve the notice period mentioned in your contract, but it should be fair. A 3-month notice when employer can fire you in 1 week is unfair.",
            "detailed_explanation": "Courts have struck down one-sided notice clauses. The principle of 'mutuality' applies - both parties should have similar obligations.",
            "examples": [
                "Contract says 'Employee: 3 months, Employer: 1 week'."
            ],
            "what_to_say": "I am willing to serve a reasonable notice period. However, the current clause seems one-sided and may not be enforceable.",
            "source_category": "Industrial Employment Act / Contract Law"
        },
        {
            "rule_id": "college_original_docs",
            "domain": "College",
            "topic": "Documents",
            "summary": "Colleges cannot keep your original certificates.",
            "verdict": "CANNOT",
            "conditions": [
                "UGC guidelines strictly prohibit withholding certificates.",
                "Cannot be held as 'security' for fees."
            ],
            "exceptions": [
                "Brief verification during admission (must be returned immediately)."
            ],
            "simple_explanation": "No college or university has the right to keep your original marksheets or degree certificates. They can only verify them and return them.",
            "detailed_explanation": "The UGC Notification on Student Entitlements states that institutions cannot rob students of their credentials to force fee payment or prevent transfer.",
            "examples": [
                "College refuses to return 10th/12th marksheets until full 4-year fee is paid."
            ],
            "what_to_say": "As per UGC guidelines, retaining original certificates is not permitted. Please verify them and return them to me today.",
            "source_category": "UGC Guidelines"
        },
        {
            "rule_id": "college_attendance_exam",
            "domain": "College",
            "topic": "Attendance",
            "summary": "Colleges can bar you from exams for low attendance.",
            "verdict": "CAN",
            "conditions": [
                "Attendance is below the mandatory limit (usually 75%).",
                "University ordinances typically support this rule."
            ],
            "exceptions": [
                "Medical grounds usually allow for 10-15% relaxation.",
                "Participation in sports/NCC/NSS."
            ],
            "simple_explanation": "Yes, colleges generally have the right to stop you from writing exams if your attendance is below 75%, unless you have a valid medical reason.",
            "detailed_explanation": "Attendance rules are set by the University's statutory ordinances. Courts usually do not interfere unless the action is arbitrary or rules weren't published.",
            "examples": [
                "You have 50% attendance and no medical certificate."
            ],
            "what_to_say": "I have valid medical reasons for my absence and can submit the necessary certificates for condonation of shortage.",
            "source_category": "University Ordinances"
        },
        {
            "rule_id": "college_fee_refund",
            "domain": "College",
            "topic": "Fees",
            "summary": "Colleges must refund fees upon withdrawal.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Within 15 days of last admission date: 100% refund (minus small processing fee).",
                "After 30 days: No refund usually mandated."
            ],
            "exceptions": [
                "Hostel fees might have different deduction rules."
            ],
            "simple_explanation": "If you withdraw your admission before the session starts or within a specific period, the college MUST refund your fees. They cannot keep the entire amount.",
            "detailed_explanation": "UGC Fee Refund Guidelines mandate a tiered refund system (100%, 90%, 80%, etc.) based on when the withdrawal is made relative to the cutoff date.",
            "examples": [
                "College says 'fees once paid is non-refundable' even if you leave in 2 days."
            ],
            "what_to_say": "As per UGC Fee Refund Guidelines, I am entitled to a refund since I am withdrawing within the stipulated permissible period.",
            "source_category": "UGC Fee Refund Policy"
        },
        {
            "rule_id": "college_ragging",
            "domain": "College",
            "topic": "Ragging",
            "summary": "Ragging is a criminal offense with severe penalties.",
            "verdict": "CANNOT",
            "conditions": [
                "Any form of ragging is banned by UGC/AICTE/Supreme Court.",
                "Colleges must have anti-ragging committees."
            ],
            "exceptions": [
                "None. Even 'mild' ragging is illegal."
            ],
            "simple_explanation": "Ragging is completely illegal. Seniors cannot force you to do anything. You have the right to report it anonymously.",
            "detailed_explanation": "UGC Regulations on Curbing Ragging (2009) make it a cognizable offense. Students involved can be expelled and jailed.",
            "examples": [
                "Seniors forcing you to dance, sing, or perform tasks.",
                "Being asked personal questions or abused."
            ],
            "what_to_say": "I do not consent to this. Ragging is illegal and I will report this to the anti-ragging committee if it continues.",
            "source_category": "UGC Anti-Ragging Regulations, 2009"
        },
        {
            "rule_id": "police_phone_search",
            "domain": "Police",
            "topic": "Search",
            "summary": "Police cannot check your phone without a warrant.",
            "verdict": "CANNOT",
            "conditions": [
                "Generally requires a warrant.",
                "You are not under arrest for a serious crime."
            ],
            "exceptions": [
                "If you are arrested, they may seize it as evidence (procedure applies).",
                "Emergency situations (rare)."
            ],
            "simple_explanation": "Police cannot simply stop you and demand to see your WhatsApp or photos. That is a violation of privacy unless they have a warrant or you are being arrested.",
            "detailed_explanation": "Privacy is a fundamental right. Random roadside checks of personal devices are not authorized under the CrPC without specific suspicion or orders.",
            "examples": [
                "Traffic police asks to see your gallery or chats."
            ],
            "what_to_say": "I do not consent to a search of my private device without a warrant or legal notice.",
            "source_category": "Right to Privacy / CrPC"
        },
        {
            "rule_id": "police_detention_reason",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "Police must tell you the reason for detention.",
            "verdict": "CAN",
            "conditions": [
                "They CAN detain you, but MUST inform you of the grounds immediately.",
                "Must be produced before a magistrate within 24 hours."
            ],
            "exceptions": [
                "Preventive detention laws (strict procedures apply)."
            ],
            "simple_explanation": "Police can detain you if they suspect a crime, BUT they must immediately tell you why. You have the right to ask 'Am I under arrest?'.",
            "detailed_explanation": "Article 22 of the Constitution guarantees that no person shall be detained without being informed of the grounds for arrest.",
            "examples": [
                "Police ask you to come to the station without saying why."
            ],
            "what_to_say": "Am I under arrest? If so, please inform me of the grounds. If not, am I free to go?",
            "source_category": "Constitution of India, Article 22"
        },
        {
            "rule_id": "police_female_arrest",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "Women generally cannot be arrested after sunset.",
            "verdict": "CANNOT",
            "conditions": [
                "Between 6 PM and 6 AM.",
                "Unless there is a special order from a Magistrate."
            ],
            "exceptions": [
                "Serious crimes with Magistrate's permission (must be by female officer)."
            ],
            "simple_explanation": "Women cannot be arrested or called to the police station between 6 PM and 6 AM. Questioning should technically happen at their residence.",
            "detailed_explanation": "Section 46(4) of the CrPC provides special protection to women, prohibiting night arrest except in exceptional circumstances with judicial permission.",
            "examples": [
                "Police try to take a woman to the station at 8 PM for questioning."
            ],
            "what_to_say": "As per the CrPC, women cannot be called to the station or arrested after sunset. Please come back with a female officer during the day.",
            "source_category": "CrPC Section 46(4)"
        },
        {
            "rule_id": "police_traffic_docs",
            "domain": "Police",
            "topic": "Traffic",
            "summary": "You must show traffic documents to uniformed officers.",
            "verdict": "CAN",
            "conditions": [
                "Officer must be in uniform.",
                "You can show digital docs via DigiLocker (valid)."
            ],
            "exceptions": [
                "If you do not have docs, you may be fined."
            ],
            "simple_explanation": "You are legally required to show your License, RC, and Insurance if a uniformed police officer asks. However, you can show them on the DigiLocker app instead of physical papers.",
            "detailed_explanation": "Under the Motor Vehicles Act, a driver must produce documents upon demand by any police officer in uniform. Digital versions are valid under IT Act/MoRTH rules.",
            "examples": [
                "Cop asks for license at a checkpost."
            ],
            "what_to_say": "I have my documents here (or on DigiLocker). I am happy to show them to you.",
            "source_category": "Motor Vehicles Act"
        },
        {
            "rule_id": "police_seize_keys",
            "domain": "Police",
            "topic": "Traffic",
            "summary": "Traffic police cannot seize your vehicle keys.",
            "verdict": "CANNOT",
            "conditions": [],
            "exceptions": [
                "If you are trying to flee or the vehicle is being impounded for a crime."
            ],
            "simple_explanation": "A traffic policeman does not have the right to forcefully take your car or bike keys to stop you. This is illegal.",
            "detailed_explanation": "No provision in the Motor Vehicles Act authorizes the seizure of keys. It is often considered harassment.",
            "examples": [
                "Cop snatches bike keys at a signal."
            ],
            "what_to_say": "Please do not remove my keys. I am cooperating and not fleeing. You can note my details.",
            "source_category": "Motor Vehicles Act Implementation"
        },
        {
            "rule_id": "police_lawyer_right",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "You have the right to a lawyer immediately upon arrest.",
            "verdict": "CAN",
            "conditions": [
                "Must be allowed to contact a lawyer of your choice.",
                "If you cannot afford one, state must provide legal aid."
            ],
            "exceptions": [
                "None. This is a fundamental right under Article 22."
            ],
            "simple_explanation": "The moment you are arrested, you have the right to call a lawyer. Police cannot deny this or interrogate you without legal counsel if you request it.",
            "detailed_explanation": "Article 22(1) guarantees the right to consult and be defended by a legal practitioner of your choice. D.K. Basu guidelines reinforce this.",
            "examples": [
                "Police say 'No lawyer until tomorrow'.",
                "Interrogation starts before lawyer arrives."
            ],
            "what_to_say": "I wish to exercise my right to legal counsel. I will not answer questions until my lawyer is present.",
            "source_category": "Constitution Article 22 / CrPC"
        },
        {
            "rule_id": "police_fir_mandatory",
            "domain": "Police",
            "topic": "FIR",
            "summary": "Police cannot refuse to register an FIR for cognizable offenses.",
            "verdict": "CANNOT",
            "conditions": [
                "For cognizable offenses (murder, theft, rape, etc.), FIR is mandatory.",
                "Must be registered at any police station (jurisdiction doesn't matter initially)."
            ],
            "exceptions": [
                "Non-cognizable offenses require magistrate permission.",
                "Clearly false/frivolous complaints can be rejected."
            ],
            "simple_explanation": "If a serious crime has occurred, police MUST register your FIR. They cannot send you away saying 'not our jurisdiction' or 'come tomorrow'.",
            "detailed_explanation": "Section 154 CrPC makes it mandatory for police to register FIR for cognizable offenses. Refusal is a punishable offense for the officer.",
            "examples": [
                "Police say 'This happened in another area, go there'.",
                "Officer says 'Settle it among yourselves'."
            ],
            "what_to_say": "As per Section 154 CrPC, you are legally bound to register my complaint. Please do so immediately or I will escalate this.",
            "source_category": "CrPC Section 154"
        },
        {
            "rule_id": "police_bribe_illegal",
            "domain": "Police",
            "topic": "Traffic",
            "summary": "Offering or accepting bribes is illegal for both parties.",
            "verdict": "CANNOT",
            "conditions": [
                "Police cannot demand bribe.",
                "You should not offer bribe either (you become complicit)."
            ],
            "exceptions": [
                "If you record the bribe demand, you can report it."
            ],
            "simple_explanation": "If a cop asks for money to let you go, that's illegal. But if you willingly pay, you are also breaking the law. Better to take the challan.",
            "detailed_explanation": "Prevention of Corruption Act makes bribery by public servants a crime. Citizens offering bribes can also be prosecuted unless they report it.",
            "examples": [
                "Traffic cop says 'Give ₹500 or I'll seize your vehicle'."
            ],
            "what_to_say": "I would prefer to pay the official fine through proper channels. Please issue me a challan.",
            "source_category": "Prevention of Corruption Act"
        },
        {
            "rule_id": "police_body_search",
            "domain": "Police",
            "topic": "Search",
            "summary": "Body searches must follow strict procedures.",
            "verdict": "CAN",
            "conditions": [
                "Female suspects can only be searched by female officers.",
                "Must be done in presence of a female family member or respectable woman.",
                "Dignity must be maintained."
            ],
            "exceptions": [
                "Emergency situations with senior officer approval."
            ],
            "simple_explanation": "Police can conduct body searches, but for women, it MUST be done by a female officer in a private place with another woman present.",
            "detailed_explanation": "Section 51 CrPC mandates strict procedures for body searches to prevent harassment and maintain decency.",
            "examples": [
                "Male officer attempts to search a woman.",
                "Search done in public view."
            ],
            "what_to_say": "As per the CrPC, a female officer must conduct this search in a private place. Please arrange for that.",
            "source_category": "CrPC Section 51"
        },
        {
            "rule_id": "doc_contract_lockin",
            "domain": "Documents",
            "topic": "Contract",
            "summary": "Lock-in periods must be reasonable.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Lock-in clauses must not be 'one-sided' or 'unconscionable'.",
                "Penalty should reflect actual loss."
            ],
            "exceptions": [
                "Commercial leases often have stricter valid lock-ins."
            ],
            "simple_explanation": "If a contract says you cannot leave for 3 years or must pay a huge fine, it might be unfair. Courts often strike down penalties that are not genuine estimates of loss.",
            "detailed_explanation": "One-sided clauses where only the employee/tenant is bound are often considered 'unfair trade practices' or void under Contract Act principles.",
            "examples": [
                "Gym membership says no refund and 1 year lock-in even if you move cities."
            ],
            "what_to_say": "This lock-in clause seems one-sided. I am willing to give reasonable notice, but a huge penalty is likely not enforceable.",
            "source_category": "Indian Contract Act / Consumer Protection"
        },
        {
            "rule_id": "landlord_deposit_refund",
            "domain": "Documents",
            "topic": "Rent",
            "summary": "Landlord must refund deposit within reasonable time.",
            "verdict": "CANNOT",
            "conditions": [
                "Deductions must be for actual damage, not 'wear and tear'.",
                "Refund usually due upon handing over keys."
            ],
            "exceptions": [
                "Unpaid rent can be deducted."
            ],
            "simple_explanation": "A landlord cannot keep your security deposit without a valid reason. They can deduct for broken items but not for painting or normal usage marks.",
            "detailed_explanation": "Tenancy agreements and Model Tenancy guidelines allow deduction only for 'damages' beyond normal wear and tear. Painting charges are usually landlord's responsibility unless agreed otherwise.",
            "examples": [
                "Landlord deducts full deposit for 'painting' after you leave."
            ],
            "what_to_say": "Please provide the bills for the damages you are claiming. Normal wear and tear is not valid for deduction.",
            "source_category": "Model Tenancy Act / Contract"
        },
        {
            "rule_id": "rent_eviction_notice",
            "domain": "Documents",
            "topic": "Rent",
            "summary": "Landlord cannot evict you without notice.",
            "verdict": "CANNOT",
            "conditions": [
                "Usually requires 1 month notice (or as per agreement).",
                "Cannot forcefully throw your things out."
            ],
            "exceptions": [
                "Court order for eviction."
            ],
            "simple_explanation": "Your landlord cannot tell you to leave 'today' or throw your belongings out. They must follow the legal process and give proper notice.",
            "detailed_explanation": "Rent control laws and the Transfer of Property Act require valid notice for termination of tenancy. Forced eviction without due process is illegal.",
            "examples": [
                "Landlord asks you to vacate in 24 hours."
            ],
            "what_to_say": "I am entitled to proper legal notice as per our agreement/law. Immediate eviction is illegal.",
            "source_category": "Rent Control Act / Transfer of Property Act"
        },
        {
            "rule_id": "landlord_entry_permission",
            "domain": "Documents",
            "topic": "Privacy",
            "summary": "Landlord cannot enter rented property without permission.",
            "verdict": "CANNOT",
            "conditions": [
                "Must give reasonable notice (24-48 hours).",
                "Can only enter for repairs/inspection with consent."
            ],
            "exceptions": [
                "Emergency situations (fire, flood, etc.)."
            ],
            "simple_explanation": "Once you rent a place, it's your home. The landlord cannot just walk in whenever they want. They need your permission except in emergencies.",
            "detailed_explanation": "The tenant has exclusive possession rights. Unauthorized entry violates privacy and can be considered trespass.",
            "examples": [
                "Landlord uses spare key to enter when you're not home.",
                "Shows up unannounced for 'inspection'."
            ],
            "what_to_say": "As per our rental agreement, you need to inform me 24 hours in advance before entering. Please respect my privacy.",
            "source_category": "Transfer of Property Act / Trespass Law"
        },
        {
            "rule_id": "consumer_no_refund",
            "domain": "Documents",
            "topic": "Consumer",
            "summary": "No Refund policies are often illegal.",
            "verdict": "CANNOT",
            "conditions": [
                "If service was deficient or product defective.",
                "Absolute 'No Refund' boards are void."
            ],
            "exceptions": [
                "Perishable goods or custom-made items."
            ],
            "simple_explanation": "Shops cannot simply say 'No Exchange/No Refund'. If the product is defective, they MUST repair, replace, or refund it.",
            "detailed_explanation": "Consumer Protection Act classes absolute restrictive trade practices as illegal. Consumers have a right to redressal for defective goods.",
            "examples": [
                "Bought a shirt, zipper is broken, shop says 'No Refund'."
            ],
            "what_to_say": "As a consumer, I am entitled to a replacement or refund for a defective product. 'No Refund' policies do not override the law.",
            "source_category": "Consumer Protection Act, 2019"
        },
        {
            "rule_id": "consumer_mrp_violation",
            "domain": "Documents",
            "topic": "Shopping",
            "summary": "Shops cannot sell above MRP.",
            "verdict": "CANNOT",
            "conditions": [
                "MRP is the maximum retail price.",
                "Includes all taxes."
            ],
            "exceptions": [
                "Hotels/restaurants can charge above MRP (service tax applies)."
            ],
            "simple_explanation": "If a product has MRP printed on it, the shop cannot charge more than that amount. Charging above MRP is illegal.",
            "detailed_explanation": "Legal Metrology Act makes it mandatory to sell at or below MRP. Violations can be penalized heavily.",
            "examples": [
                "Shop charges ₹120 for item with MRP ₹100.",
                "Cinema charges extra for water bottle."
            ],
            "what_to_say": "The MRP printed on this product is ₹X. You cannot charge more than that. Please adjust the bill.",
            "source_category": "Legal Metrology Act, 2009"
        },
        {
            "rule_id": "flight_cancellation",
            "domain": "Documents",
            "topic": "Flight",
            "summary": "Airlines must compensate for flight delays and cancellations.",
            "verdict": "CAN",
            "conditions": [
                "Domestic: ₹5000 for delays > 3 hours, ₹10000 for cancellations.",
                "Must be informed 2 weeks in advance to avoid compensation."
            ],
            "exceptions": [
                "Extraordinary circumstances (weather, security) exempt airlines.",
                "If alternate flight is arranged within 1 hour."
            ],
            "simple_explanation": "If your flight is delayed or cancelled without proper notice, the airline owes you compensation plus hotel/meals if needed.",
            "detailed_explanation": "DGCA Civil Aviation Requirements mandate compensation for delays, cancellations, and denied boarding due to overbooking.",
            "examples": [
                "Flight cancelled 2 hours before departure with no reason."
            ],
            "what_to_say": "As per DGCA regulations, I am entitled to compensation for this delay/cancellation. Please issue it immediately or provide written reasons.",
            "source_category": "DGCA CAR, Section 3"
        },
        {
            "rule_id": "cybercrime_reporting",
            "domain": "Police",
            "topic": "Cybercrime",
            "summary": "You can report cybercrimes online and to local police.",
            "verdict": "CAN",
            "conditions": [
                "Report to cybercrime.gov.in or local cyber cell.",
                "FIR mandatory for serious crimes like hacking, fraud."
            ],
            "exceptions": [
                "Minor issues can be flagged to platform (Twitter, Instagram)."
            ],
            "simple_explanation": "If someone hacks your account, leaks your photos, or scams you online, you can file a complaint with the cyber cell. It's a legal offense.",
            "detailed_explanation": "IT Act, 2000 covers cybercrimes like hacking, identity theft, and online harassment. Penalties include jail time.",
            "examples": [
                "Someone creates fake profile using your photos.",
                "Online shopping fraud."
            ],
            "what_to_say": "I want to file a cybercrime complaint. Here are the screenshots and evidence.",
            "source_category": "IT Act, 2000"
        },
        {
            "rule_id": "drunk_driving",
            "domain": "Police",
            "topic": "Alcohol",
            "summary": "Drunk driving is illegal and police can conduct breathalyzer tests.",
            "verdict": "CAN",
            "conditions": [
                "Blood alcohol limit: 30 mg per 100 ml.",
                "Police can test if they suspect drunk driving."
            ],
            "exceptions": [
                "You can request a blood test if you dispute breathalyzer."
            ],
            "simple_explanation": "Driving under the influence is illegal. If caught, you can face heavy fines, license suspension, and even jail time.",
            "detailed_explanation": "Motor Vehicles Act Section 185 criminalizes drunk driving with penalties up to ₹10,000 and 6 months jail for first offense.",
            "examples": [
                "Stopped at checkpoint and breathalyzer shows positive."
            ],
            "what_to_say": "I understand the law. If I test positive, please follow due process and I'd like to see the calibration certificate of the device.",
            "source_category": "Motor Vehicles Act, Section 185"
        },
        {
            "rule_id": "minor_detention",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "Juveniles (under 18) have special protections.",
            "verdict": "CANNOT",
            "conditions": [
                "Cannot be kept in police lockup with adults.",
                "Must be sent to Juvenile Justice Board within 24 hours.",
                "Parents/guardians must be informed immediately."
            ],
            "exceptions": [
                "Heinous crimes may have different procedures (tried as adult in some cases)."
            ],
            "simple_explanation": "If you are under 18, police cannot treat you like an adult offender. You must be kept separate and produced before a special board, not a regular court.",
            "detailed_explanation": "Juvenile Justice Act, 2015 provides special treatment, rehabilitation focus, and strict procedural safeguards for minors.",
            "examples": [
                "17-year-old kept in adult lockup overnight."
            ],
            "what_to_say": "I am a minor. As per the JJ Act, I must be produced before the Juvenile Justice Board and my parents must be informed.",
            "source_category": "Juvenile Justice Act, 2015"
        },
        {
            "rule_id": "online_fraud",
            "domain": "Police",
            "topic": "Cybercrime",
            "summary": "Online fraud victims can report and potentially recover money.",
            "verdict": "CAN",
            "conditions": [
                "Report within 24 hours for best chance of recovery.",
                "File complaint at cybercrime.gov.in and local police."
            ],
            "exceptions": [
                "If money transferred outside India, recovery is harder."
            ],
            "simple_explanation": "If you fall victim to UPI fraud, fake shopping sites, or phishing, report immediately. Police can freeze the fraudster's account if you act fast.",
            "detailed_explanation": "National Cyber Crime Reporting Portal connects to banks and can freeze suspicious accounts within hours if reported quickly.",
            "examples": [
                "Clicked phishing link, ₹50,000 debited from account."
            ],
            "what_to_say": "I've been defrauded online. Here's the transaction ID and fraudster's account details. Please freeze the account immediately.",
            "source_category": "IT Act / IPC Sections 419, 420"
        },
        {
            "rule_id": "illegal_towing",
            "domain": "Police",
            "topic": "Towing",
            "summary": "Vehicle can only be towed for specific violations with proper procedure.",
            "verdict": "CAN",
            "conditions": [
                "Must be in no-parking zone or obstructing traffic.",
                "Receipt must be issued with recovery location."
            ],
            "exceptions": [
                "Emergency clearance for ambulance/fire brigade path."
            ],
            "simple_explanation": "Police or traffic authorities can tow your vehicle if it's illegally parked, but they must give you a proper receipt and tell you where to collect it.",
            "detailed_explanation": "Motor Vehicles Act allows towing but mandates documentation. Arbitrary towing or extortion for release is illegal.",
            "examples": [
                "Car towed from regular parking spot without notice."
            ],
            "what_to_say": "Why was my vehicle towed? Please provide the official receipt and penalty details as per the MV Act.",
            "source_category": "Motor Vehicles Act"
        }
    ]
}