{
    "rules": [
        {
            "rule_id": "hr_salary_delay",
            "domain": "Workplace",
            "topic": "Salary",
            "summary": "Employer cannot delay salary without notice.",
            "verdict": "CANNOT",
            "conditions": [
                "Wages must be paid by the 7th-10th of the following month (Payment of Wages Act)."
            ],
            "exceptions": [
                "Companies with < 1,000 employees can pay by the 7th; others by the 10th.",
                "Written agreement for different cycle (rare exceptions)."
            ],
            "simple_explanation": "Your employer must pay your salary on time, usually by the 7th or 10th of the month. They cannot simply delay it without a valid reason and prior notice.",
            "detailed_explanation": "Under the Payment of Wages Act, 1936, employers are legally bound to pay wages on time. Deductions or delays are only permitted for specific reasons like authorized absence, and must be communicated.",
            "examples": [
                "Boss says 'money is tight' and holds salary for 2 months.",
                "Salary is consistently paid on the 20th without agreement."
            ],
            "what_to_say": "I understand the situation, but my financial commitments rely on my salary being paid by the 7th as per the Payment of Wages Act. Please confirm when it will be credited.",
            "next_steps": [
                "âœ‰ï¸ Send a written email/letter to HR and your manager asking for salary payment with reference to the Payment of Wages Act, 1936.",
                "ðŸ“‹ Keep records of all communications (emails, messages, pay slips showing delay).",
                "â° If not paid within 7 days, send a formal legal notice through a lawyer (many lawyers offer free consultation).",
                "ðŸ›ï¸ File a complaint with the Labour Commissioner in your state (can be done online in most states).",
                "ðŸ’¼ Reach out to your company's escalation matrix (skip-level manager, head of HR, or company directors).",
                "ðŸ“ž Call the Labour Department helpline: 1800-11-6666 for guidance.",
                "âš ï¸ As a last resort, you can file a case under the Payment of Wages Act - maximum penalty includes imprisonment for the employer."
            ],
            "source_category": "Payment of Wages Act, 1936"
        },
        {
            "rule_id": "hr_unpaid_overtime",
            "domain": "Workplace",
            "topic": "Overtime",
            "summary": "Unpaid overtime is generally not allowed for eligible employees.",
            "verdict": "CANNOT",
            "conditions": [
                "Work beyond 9 hours/day or 48 hours/week usually requires 2x pay (Factories Act/Shops Act).",
                "Applies to 'workmen' or non-managerial roles mostly."
            ],
            "exceptions": [
                "Managerial or Administrative roles often have different contracts.",
                "Startups with specific employment agreements (though laws still apply)."
            ],
            "simple_explanation": "If you are working beyond your shift hours, you are generally entitled to overtime pay or compensatory off, unless your contract specifically excludes it for your role.",
            "detailed_explanation": "The Minimum Wages Act and Shops & Establishments Act mandate overtime payment at double the normal rate for work exceeding standard hours. 'Managerial' exemptions are often misused.",
            "examples": [
                "Boss asks you to stay late every day without extra pay.",
                "Working weekends typically requires a 'Comp-off' or overtime pay."
            ],
            "what_to_say": "I am happy to support the team, but these extra hours are significant. Can we discuss overtime pay or compensatory off for this time?",
            "next_steps": [
                "ðŸ“Š Track your hours - Maintain a daily log of actual working hours vs contracted hours (use a spreadsheet or time-tracking app).",
                "ðŸ“§ Email your manager documenting overtime hours worked and request compensation (keep this for legal proof).",
                "ðŸ“– Check your employment contract - See if overtime is mentioned and what the agreed rate is.",
                "âš–ï¸ Know your rights - Overtime should be paid at 2x normal rate as per Minimum Wages Act/Shops Act.",
                "ðŸ—£ï¸ Raise it formally - Send written request to HR for overtime pay or compensatory off with dates and hours.",
                "ðŸ›ï¸ File complaint with Labour Commissioner if company refuses (online complaint available in most states).",
                "ðŸ’¡ Consider alternatives - If company won't pay, negotiate for flex hours, comp-off days, or adjusted work schedule."
            ],
            "source_category": "Minimum Wages Act, 1948"
        },
        {
            "rule_id": "hr_forced_resignation",
            "domain": "Workplace",
            "topic": "Termination",
            "summary": "Employers cannot force you to resign.",
            "verdict": "CANNOT",
            "conditions": [
                "Forced resignation is legally treated as illegal termination.",
                "You have the right to refuse to sign."
            ],
            "exceptions": [
                "If you are being terminated for proven gross misconduct (with inquiry)."
            ],
            "simple_explanation": "Your boss cannot force you to write a resignation letter. If they want to fire you, they must give you a termination letter, which usually requires severance or notice pay.",
            "detailed_explanation": "Companies often force resignation to avoid paying retrenchment compensation or to hide firing statistics. This is illegal under the Industrial Disputes Act.",
            "examples": [
                "HR calls you into a room and demands you sign a resignation letter immediately."
            ],
            "what_to_say": "I am not resigning. If the company wishes to terminate my employment, please provide a formal termination letter stating the reasons.",
            "next_steps": [
                "ðŸš« DO NOT sign any resignation letter - you cannot take this back once signed.",
                "ðŸ“§ Send an immediate email to HR and your manager stating 'I am not resigning voluntarily. Any termination must be in writing with reasons.'",
                "ðŸ“± Record the conversation (audio/video) if possible in states where single-party consent is legal.",
                "ðŸ“„ If they terminate you, demand: (1) Termination letter with reasons, (2) Full and final settlement, (3) Experience/Relieving letter.",
                "ðŸ’° You may be entitled to: Notice pay (1-3 months salary), Gratuity (if 5+ years), Unused leave encashment, Pending salary.",
                "âš–ï¸ File a complaint with the Labour Commissioner for 'illegal termination' if they don't follow due process.",
                "ðŸ—£ï¸ Consult a labour lawyer immediately - many offer free initial consultation. You can sue for wrongful termination and claim compensation."
            ],
            "source_category": "Industrial Disputes Act, 1947"
        },
        {
            "rule_id": "hr_bond_enforcement",
            "domain": "Workplace",
            "topic": "Bond",
            "summary": "Employment bonds are only valid for training costs.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Employer must prove they spent money on your specific training.",
                "Bond amount must be reasonable and proportionate to the loss."
            ],
            "exceptions": [
                "Generic 'onboarding' costs do not count.",
                "Bonds cannot be used to force you to stay against your will (forced labor)."
            ],
            "simple_explanation": "A bond is only valid if the company spent actual money on your specialized training. They cannot demand a huge random amount just for leaving.",
            "detailed_explanation": "Section 27 of the Indian Contract Act voids agreements in restraint of trade. Courts only allow recovery of 'actual training expenses', not penalties.",
            "examples": [
                "Company asks for â‚¹2 Lakhs for leaving, but gave no training."
            ],
            "what_to_say": "I am willing to reimburse the actual cost of training provided to me. Please share the breakdown of these specific expenses.",
            "next_steps": [
                "ðŸ“„ Request bond breakdown in writing - Ask HR/company to provide itemized list of training costs they claim.",
                "ðŸ” Verify actual training - Check if you received specialized training (certifications, external courses) vs regular onboarding.",
                "âš–ï¸ Know the law - Section 27 of Indian Contract Act prohibits restraint of trade; bonds are only valid for genuine training costs.",
                "ðŸ’° Negotiate settlement - Most companies settle for 30-50% of claimed amount rather than go to court.",
                "ðŸ“§ Send legal notice through lawyer - Often companies drop demands when they receive lawyer's notice.",
                "ðŸ›ï¸ File case if harassed - Approach Labour Court if company threatens salary withholding or experience letter denial.",
                "ðŸŽ¯ Final option - Simply resign and leave; many bond clauses are unenforceable and companies rarely pursue legal action."
            ],
            "source_category": "Indian Contract Act, 1872"
        },
        {
            "rule_id": "hr_experience_letter",
            "domain": "Workplace",
            "topic": "Termination",
            "summary": "Employer cannot withhold your Experience Letter.",
            "verdict": "CANNOT",
            "conditions": [
                "You have served the notice period or paid in lieu of it.",
                "No pending dues from your side."
            ],
            "exceptions": [
                "If you absconded without notice."
            ],
            "simple_explanation": "If you have resigned properly and served your notice, the company must provide an Experience/Relieving letter. They cannot hold it hostage.",
            "detailed_explanation": "Withholding service certificates restricts an employee's right to profession (Article 19(1)(g)). Courts have ruled that employers are duty-bound to issue these.",
            "examples": [
                "HR says they won't give relieving letter until you sign a non-compete."
            ],
            "what_to_say": "I have completed my exit formalities. Withholding my experience letter is legally untenable. Please release it immediately.",
            "next_steps": [
                "ðŸ“§ Send formal email to HR - Request experience/relieving letter immediately, mention completion of all exit formalities.",
                "ðŸ“‹ Follow up in writing every 3 days - Create paper trail of your requests (emails are legal proof).",
                "âš–ï¸ Send legal notice after 15 days - Hire a lawyer to send notice citing violation of right to profession (Article 19).",
                "ðŸ›ï¸ File complaint with Labour Commissioner - They can order company to issue documents.",
                "ðŸ“ Get statutory declaration - If company still refuses, get a notarized affidavit of your employment (temporary solution for job search).",
                "ðŸ’¼ Inform new employer - Most good companies understand this issue and may hire you pending letter.",
                "âš ï¸ File civil suit - As last resort, approach civil court for direction to release documents + damages."
            ],
            "source_category": "Industrial Disputes Act / Shops Act"
        },
        {
            "rule_id": "hr_maternity_leave",
            "domain": "Workplace",
            "topic": "Maternity",
            "summary": "Female employees are entitled to 26 weeks of maternity leave.",
            "verdict": "CAN",
            "conditions": [
                "For first two children: 26 weeks (8 weeks can be before delivery).",
                "For third child onwards: 12 weeks.",
                "Applies to establishments with 10+ employees."
            ],
            "exceptions": [
                "Employers can ask for proof of pregnancy.",
                "Work-from-home option can be offered after initial leave."
            ],
            "simple_explanation": "You have the legal right to take paid maternity leave for 26 weeks. Your employer cannot fire you or deny this benefit.",
            "detailed_explanation": "The Maternity Benefit Act, 1961 (amended 2017) mandates paid leave. Employers who deny this face penalties and compensation orders.",
            "examples": [
                "Boss says 'We can only give you one month off'.",
                "Company threatens to terminate during pregnancy."
            ],
            "what_to_say": "As per the Maternity Benefit Act, I am entitled to 26 weeks of paid leave. Please confirm the process for formally applying.",
            "next_steps": [
                "ðŸ“‹ Apply formally in writing - Submit maternity leave application to HR with expected delivery date (minimum 8 weeks before).",
                "ðŸ“„ Provide medical certificate - Attach doctor's certificate confirming pregnancy and expected delivery date.",
                "ðŸ’° Confirm salary during leave - Ensure HR confirms you'll receive full salary for all 26 weeks.",
                "ðŸ“§ Document everything - Keep copies of all communications regarding your leave application.",
                "âš–ï¸ Know your full rights - 26 weeks for first 2 children, 12 weeks for 3rd onwards, nursing breaks for 15 months post-delivery.",
                "ðŸš« Report threats/denial - If company threatens termination or denies leave, immediately contact Labour Commissioner.",
                "ðŸ›ï¸ File complaint if denied - Maternity Benefit Act violation can result in imprisonment for employer + compensation to you."
            ],
            "source_category": "Maternity Benefit Act, 1961"
        },
        {
            "rule_id": "hr_sexual_harassment",
            "domain": "Workplace",
            "topic": "Harassment",
            "summary": "Employers must have a POSH committee and cannot ignore complaints.",
            "verdict": "CANNOT",
            "conditions": [
                "All workplaces with 10+ employees must have Internal Complaints Committee.",
                "Complaints must be investigated within 90 days."
            ],
            "exceptions": [
                "False/malicious complaints can lead to action against complainant."
            ],
            "simple_explanation": "If you face sexual harassment at work, your company is legally required to investigate. They cannot dismiss your complaint or retaliate against you.",
            "detailed_explanation": "The POSH Act (Sexual Harassment of Women at Workplace Act, 2013) mandates strict procedures. Retaliation is a criminal offense.",
            "examples": [
                "Manager makes inappropriate comments, HR ignores complaint.",
                "Company says 'just ignore him' without inquiry."
            ],
            "what_to_say": "I would like to file a formal complaint under the POSH Act. Please direct me to the Internal Complaints Committee.",
            "next_steps": [
                "ðŸ“ Document everything - Note down dates, times, witnesses, and exact details of each harassment incident immediately.",
                "ðŸ“§ File written complaint to ICC - Every company with 10+ employees must have Internal Complaints Committee. Ask HR for ICC contact.",
                "ðŸ“± Keep evidence - Save messages, emails, recordings (if legally recorded), or any proof of harassment.",
                "ðŸ”’ Confidentiality protected - POSH Act mandates strict confidentiality; company cannot share your complaint details.",
                "â° Timeline - ICC must complete inquiry within 90 days. You can follow up on progress.",
                "ðŸ›ï¸ External option - If company has no ICC or doesn't act, file complaint with Local Complaints Committee (district level).",
                "âš–ï¸ Criminal case - For serious harassment, file FIR under IPC Section 354A; POSH complaint and criminal case can run parallel.",
                "ðŸ¤ Seek support - Contact NGOs like Safecity, SHE Teams, or National Commission for Women helpline: 7827-170-170."
            ],
            "source_category": "POSH Act, 2013"
        },
        {
            "rule_id": "hr_pf_mandatory",
            "domain": "Workplace",
            "topic": "Gratuity",
            "summary": "PF and Gratuity are mandatory for eligible employees.",
            "verdict": "CANNOT",
            "conditions": [
                "PF is mandatory for organizations with 20+ employees.",
                "Gratuity is due after 5 years of service.",
                "Both employee and employer contribute to PF (12% each)."
            ],
            "exceptions": [
                "Some government exemptions exist for certain sectors."
            ],
            "simple_explanation": "Your employer cannot refuse to enroll you in PF or deny gratuity after 5 years. These are statutory benefits.",
            "detailed_explanation": "The Employees' Provident Fund Act and Payment of Gratuity Act make these benefits mandatory. Non-compliance invites legal action.",
            "examples": [
                "Company says 'We don't provide PF for contract workers'.",
                "Employer refuses gratuity saying you resigned."
            ],
            "what_to_say": "PF enrollment is mandatory under the EPF Act. Please initiate my registration immediately.",
            "next_steps": [
                "ðŸ“§ Send written request to HR - Email asking for PF enrollment with reference to EPF Act, 1952.",
                "ðŸ” Check online - Visit EPFO portal (epfindia.gov.in) and search your UAN using Aadhaar to see if you're registered.",
                "ðŸ“‹ Know your rights - Company MUST enroll you in PF if they have 20+ employees and you earn below â‚¹15,000 basic.",
                "ðŸ’° Employer contribution - Company must contribute 12% + you contribute 12% = total 24% of basic salary goes to PF.",
                "âš–ï¸ File complaint - If company refuses, file online complaint at EPFO portal or call EPF helpline: 1800-118-005.",
                "ðŸ›ï¸ Gratuity after 5 years - If you complete 5 years, you're entitled to gratuity = 15 days salary Ã— years of service.",
                "âš ï¸ Legal action - PF denial is a criminal offense; company can face penalties and you can claim damages."
            ],
            "source_category": "EPF Act / Payment of Gratuity Act"
        },
        {
            "rule_id": "hr_notice_period",
            "domain": "Workplace",
            "topic": "Resignation",
            "summary": "Notice period must be mutual and reasonable.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Standard notice is 1-3 months as per contract.",
                "Employer cannot have different notice periods for employee vs company."
            ],
            "exceptions": [
                "You can negotiate buyout of notice period.",
                "Summary dismissal for gross misconduct doesn't require notice."
            ],
            "simple_explanation": "You must serve the notice period mentioned in your contract, but it should be fair. A 3-month notice when employer can fire you in 1 week is unfair.",
            "detailed_explanation": "Courts have struck down one-sided notice clauses. The principle of 'mutuality' applies - both parties should have similar obligations.",
            "examples": [
                "Contract says 'Employee: 3 months, Employer: 1 week'."
            ],
            "what_to_say": "I am willing to serve a reasonable notice period. However, the current clause seems one-sided and may not be enforceable.",
            "next_steps": [
                "ðŸ“„ Review your contract - Check exact notice period clause and compare what's required from employee vs employer.",
                "âš–ï¸ Challenge one-sided clauses - Courts have struck down notices like '3 months for employee, 0 for employer' as unfair.",
                "ðŸ’¬ Negotiate with company - Request mutual notice reduction or buyout option (pay 1-2 months instead of serving 3).",
                "ðŸ“§ Serve written notice - Send formal resignation email/letter to HR and manager with your proposed last working day.",
                "ðŸ¤ Discuss early relief - Many companies allow immediate relief or shorter notice if replacement is found or handover is complete.",
                "ðŸ’° Calculate buyout cost - If paying in lieu, you typically pay your salary amount for notice period not served.",
                "ðŸƒ Leave if critical - If you have urgent offer, you can leave; company rarely pursues legal action for notice violations (but you may lose references)."
            ],
            "source_category": "Industrial Employment Act / Contract Law"
        },
        {
            "rule_id": "college_original_docs",
            "domain": "College",
            "topic": "Documents",
            "summary": "Colleges cannot keep your original certificates.",
            "verdict": "CANNOT",
            "conditions": [
                "UGC guidelines strictly prohibit withholding certificates.",
                "Cannot be held as 'security' for fees."
            ],
            "exceptions": [
                "Brief verification during admission (must be returned immediately)."
            ],
            "simple_explanation": "No college or university has the right to keep your original marksheets or degree certificates. They can only verify them and return them.",
            "detailed_explanation": "The UGC Notification on Student Entitlements states that institutions cannot rob students of their credentials to force fee payment or prevent transfer.",
            "examples": [
                "College refuses to return 10th/12th marksheets until full 4-year fee is paid."
            ],
            "what_to_say": "As per UGC guidelines, retaining original certificates is not permitted. Please verify them and return them to me today.",
            "next_steps": [
                "ðŸ“§ Send written request to college - Email principal/registrar demanding immediate return of certificates.",
                "ðŸ“‹ Cite UGC guidelines - Reference 'UGC Notification on Student Entitlements' that prohibits withholding documents.",
                "ðŸ“ž Call UGC helpline -  Dial 1800-111-656 (UGC) or 011-23239196 to report violation.",
                "ðŸ“± File complaint online - Go to grievance.ugc.ac.in and register complaint against college.",
                "âš–ï¸ Send legal notice - Have a lawyer send notice demanding return within 7 days.",
                "ðŸ›ï¸ Approach court - File writ petition in High Court; courts take serious view of certificate withholding.",
                "ðŸ“ Get RTI information - File RTI asking under what authority college is keeping your documents.",
                "ðŸ’¼ Escalate to University - Complaint to affiliated university; they can directcollege to release documents."
            ],
            "source_category": "UGC Guidelines"
        },
        {
            "rule_id": "college_attendance_exam",
            "domain": "College",
            "topic": "Attendance",
            "summary": "Colleges can bar you from exams for low attendance.",
            "verdict": "CAN",
            "conditions": [
                "Attendance is below the mandatory limit (usually 75%).",
                "University ordinances typically support this rule."
            ],
            "exceptions": [
                "Medical grounds usually allow for 10-15% relaxation.",
                "Participation in sports/NCC/NSS."
            ],
            "simple_explanation": "Yes, colleges generally have the right to stop you from writing exams if your attendance is below 75%, unless you have a valid medical reason.",
            "detailed_explanation": "Attendance rules are set by the University's statutory ordinances. Courts usually do not interfere unless the action is arbitrary or rules weren't published.",
            "examples": [
                "You have 50% attendance and no medical certificate."
            ],
            "what_to_say": "I have valid medical reasons for my absence and can submit the necessary certificates for condonation of shortage.",
            "next_steps": [
                "ðŸï¸ Get medical certificates - Collect all doctor certificates, prescription bills for sick days.",
                "ðŸ“§ Apply for condonation - Submit formal application to HOD/Dean with medical proof requesting attendance shortage condonation.",
                "ðŸ“‹ Check university rules - Most universities allow 10-15% relaxation for medical/sports/NCC participation.",
                "ðŸŽ¯ Gather evidence - College attendance register, emails about participation in events, sports certificates.",
                "ðŸ‘¥ Get support letter - If attended seminars/competitions, get certificate from organizing committee.",
                "âš–ï¸ Know your rights - Arbitrary denial without considering genuine reasons can be challenged in court.",
                "ðŸ›ï¸ File writ petition - If college unreasonably denies despite valid reasons, approach High Court.",
                "ðŸ“ž Contact university - Escalate to university's grievance cell if college doesn't respond."
            ],
            "source_category": "University Ordinances"
        },
        {
            "rule_id": "college_fee_refund",
            "domain": "College",
            "topic": "Fees",
            "summary": "Colleges must refund fees upon withdrawal.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Within 15 days of last admission date: 100% refund (minus small processing fee).",
                "After 30 days: No refund usually mandated."
            ],
            "exceptions": [
                "Hostel fees might have different deduction rules."
            ],
            "simple_explanation": "If you withdraw your admission before the session starts or within a specific period, the college MUST refund your fees. They cannot keep the entire amount.",
            "detailed_explanation": "UGC Fee Refund Guidelines mandate a tiered refund system (100%, 90%, 80%, etc.) based on when the withdrawal is made relative to the cutoff date.",
            "examples": [
                "College says 'fees once paid is non-refundable' even if you leave in 2 days."
            ],
            "what_to_say": "As per UGC Fee Refund Guidelines, I am entitled to a refund since I am withdrawing within the stipulated permissible period.",
            "next_steps": [
                "ðŸ“§ Submit withdrawal in writing - Email formal withdrawal letter to college with date and reason.",
                "ðŸ’° Check timeline - If within 15 days of admission: 100% refund; 15-30 days: 90% refund, etc.",
                "ðŸ“‹ Demand fee receipt - College must give detailed fee receipt showing all components.",
                "ðŸ“± Know UGC rules - Visit UGC website and download 'Fee Refund Policy' to show college.",
                "ðŸ“ž Call UGC helpline - Report violation at 1800-111-656 if college refuses refund.",
                "âš–ï¸ Send legal notice - If college delays beyond 30 days, send lawyer's notice.",
                "ðŸ›ï¸ File consumer complaint - Approach Consumer Disputes Redressal Forum for refund + compensation.",
                "ðŸ“§ Email to authorities - Send complaint to university registrar, VCand education department."
            ],
            "source_category": "UGC Fee Refund Policy"
        },
        {
            "rule_id": "college_ragging",
            "domain": "College",
            "topic": "Ragging",
            "summary": "Ragging is a criminal offense with severe penalties.",
            "verdict": "CANNOT",
            "conditions": [
                "Any form of ragging is banned by UGC/AICTE/Supreme Court.",
                "Colleges must have anti-ragging committees."
            ],
            "exceptions": [
                "None. Even 'mild' ragging is illegal."
            ],
            "simple_explanation": "Ragging is completely illegal. Seniors cannot force you to do anything. You have the right to report it anonymously.",
            "detailed_explanation": "UGC Regulations on Curbing Ragging (2009) make it a cognizable offense. Students involved can be expelled and jailed.",
            "examples": [
                "Seniors forcing you to dance, sing, or perform tasks.",
                "Being asked personal questions or abused."
            ],
            "what_to_say": "I do not consent to this. Ragging is illegal and I will report this to the anti-ragging committee if it continues.",
            "next_steps": [
                "ðŸ“ž Report immediately - Call National Anti-Ragging Helpline: 1800-180-5522 (24x7 toll-free).",
                "ðŸ“± Online complaint - Go to antiragging.in and file complaint (can be anonymous).",
                "ðŸ“ Document evidence - Record videos/audio, take screenshots of messages, note dates/times/names.",
                "ðŸš« Don't comply - Never participate even if pressured; ragging victims become perpetrators legally.",
                "ðŸ« Inform college committee - Every college has Anti-Ragging Committee and Squad; file written complaint.",
                "ðŸ‘® File FIR - Ragging is criminal offense; go to nearest police station to file FIR.",
                "âš–ï¸ Know the law - Perpetrators face expulsion, 3 years jail, fine; college can lose recognition.",
                "ðŸ¤ Talk to parents/counselor - Seek emotional support; many colleges have counseling services."
            ],
            "source_category": "UGC Anti-Ragging Regulations, 2009"
        },
        {
            "rule_id": "police_phone_search",
            "domain": "Police",
            "topic": "Search",
            "summary": "Police cannot check your phone without a warrant.",
            "verdict": "CANNOT",
            "conditions": [
                "Generally requires a warrant.",
                "You are not under arrest for a serious crime."
            ],
            "exceptions": [
                "If you are arrested, they may seize it as evidence (procedure applies).",
                "Emergency situations (rare)."
            ],
            "simple_explanation": "Police cannot simply stop you and demand to see your WhatsApp or photos. That is a violation of privacy unless they have a warrant or you are being arrested.",
            "detailed_explanation": "Privacy is a fundamental right. Random roadside checks of personal devices are not authorized under the CrPC without specific suspicion or orders.",
            "examples": [
                "Traffic police asks to see your gallery or chats."
            ],
            "what_to_say": "I do not consent to a search of my private device without a warrant or legal notice.",
            "next_steps": [
                "ðŸš« Politely refuse - Say 'I do not consent to phone search without a warrant. This is my right to privacy.'",
                "ðŸ“± Lock your phone immediately - Use biometric/password lock so it can't be accessed.",
                "ðŸŽ¥ Start recording (if safe) - Some states allow single-party consent recording; this creates evidence.",
                "ðŸ‘¥ Call a witness - If stopped in public, ask a friend/family member to come or stay on call as witness.",
                "ðŸ“ Note details - Officer's name, badge number, time, location - document everything.",
                "âš–ï¸ Know your rights - Police need warrant under CrPC unless you're arrested for serious crime.",
                "ðŸ“ž Call helpline if harassed - Dial 100 (police control room) or state police complaint number to report harassment.",
                "ðŸ›ï¸ File complaint later - If forced to show phone, file complaint at police station or with SP/Commissioner the same day."
            ],
            "source_category": "Right to Privacy / CrPC"
        },
        {
            "rule_id": "police_detention_reason",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "Police must tell you the reason for detention.",
            "verdict": "CAN",
            "conditions": [
                "They CAN detain you, but MUST inform you of the grounds immediately.",
                "Must be produced before a magistrate within 24 hours."
            ],
            "exceptions": [
                "Preventive detention laws (strict procedures apply)."
            ],
            "simple_explanation": "Police can detain you if they suspect a crime, BUT they must immediately tell you why. You have the right to ask 'Am I under arrest?'.",
            "detailed_explanation": "Article 22 of the Constitution guarantees that no person shall be detained without being informed of the grounds for arrest.",
            "examples": [
                "Police ask you to come to the station without saying why."
            ],
            "what_to_say": "Am I under arrest? If so, please inform me of the grounds. If not, am I free to go?",
            "next_steps": [
                "â“ Ask clearly - 'Am I under arrest? What is the reason?' They MUST tell you.",
                "ðŸ“ Note everything - Officer names, badge numbers, exact time, reason given for detention.",
                "ðŸ“ž Call family/lawyer - You have right to make ONE phone call immediately after arrest.",
                "ðŸš« Don't sign anything - Do not sign any blank papers or statements without reading/lawyer present.",
                "â° 24-hour rule - Police must produce you before magistrate within 24 hours of arrest.",
                "ðŸ¤ Stay silent - You can refuse to answer questions until lawyer arrives (right against self-incrimination).",
                "ðŸ“§ Get memo - Police must give you arrest memo with grounds of arrest in writing.",
                "ðŸ›ï¸ Demand magistrate - If illegal detention, demand to be taken to magistrate immediately."
            ],
            "source_category": "Constitution of India, Article 22"
        },
        {
            "rule_id": "police_female_arrest",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "Women generally cannot be arrested after sunset.",
            "verdict": "CANNOT",
            "conditions": [
                "Between 6 PM and 6 AM.",
                "Unless there is a special order from a Magistrate."
            ],
            "exceptions": [
                "Serious crimes with Magistrate's permission (must be by female officer)."
            ],
            "simple_explanation": "Women cannot be arrested or called to the police station between 6 PM and 6 AM. Questioning should technically happen at their residence.",
            "detailed_explanation": "Section 46(4) of the CrPC provides special protection to women, prohibiting night arrest except in exceptional circumstances with judicial permission.",
            "examples": [
                "Police try to take a woman to the station at 8 PM for questioning."
            ],
            "what_to_say": "As per the CrPC, women cannot be called to the station or arrested after sunset. Please come back with a female officer during the day.",
            "next_steps": [
                "ðŸ• Check time - If between 6 PM - 6 AM, you have special protection under law.",
                "ðŸš« Firmly refuse - Say 'I know my rights under CrPC Section 46(4). You cannot arrest me at night.'",
                "ðŸ“± Call family/lawyer - Inform them immediately of the situation.",
                "ðŸ‘® Demand female officer - If they insist, demand that a female police officer must be present.",
                "ðŸ“ Ask for written notice - Any questioning must have written justification and Magistrate's permission for night arrest.",
                "ðŸ  Home questioning only - For minor cases, they can question at your residence, not police station.",
                "ðŸ“ž Call women's helpline - Dial 1091 (Women Helpline) or 181 (Women in Distress) for immediate support.",
                "ðŸ›ï¸ File complaint next day - If harassed, file complaint with SP/Commissioner against the officers."
            ],
            "source_category": "CrPC Section 46(4)"
        },
        {
            "rule_id": "police_traffic_docs",
            "domain": "Police",
            "topic": "Traffic",
            "summary": "You must show traffic documents to uniformed officers.",
            "verdict": "CAN",
            "conditions": [
                "Officer must be in uniform.",
                "You can show digital docs via DigiLocker (valid)."
            ],
            "exceptions": [
                "If you do not have docs, you may be fined."
            ],
            "simple_explanation": "You are legally required to show your License, RC, and Insurance if a uniformed police officer asks. However, you can show them on the DigiLocker app instead of physical papers.",
            "detailed_explanation": "Under the Motor Vehicles Act, a driver must produce documents upon demand by any police officer in uniform. Digital versions are valid under IT Act/MoRTH rules.",
            "examples": [
                "Cop asks for license at a checkpost."
            ],
            "what_to_say": "I have my documents here (or on DigiLocker). I am happy to show them to you.",
            "next_steps": [
                "ðŸ“± Use DigiLocker - Download DigiLocker app and keep DL, RC, Insurance there (100% legal and courts accept it).",
                "âœ… Always carry/show - You MUST show documents when uniformed officer asks; refusal leads to fine.",
                "ðŸ“¸ Keep photos backup - Have photos of all documents on phone as backup.",
                "ðŸ“„ Check validity - Ensure your license, RC, insurance, and PUC are not expired before driving.",
                "ðŸ’° Pay challan online - If fined, you can pay online through e-challan portal or Paytm to avoid hassle.",
                "ðŸš— Document condition - If stopped, politely cooperate; arguing can lead to more scrutiny.",
                "ðŸ“ž Know your RTO - Keep your RTO number and vehicle details memorized for quick reference."
            ],
            "source_category": "Motor Vehicles Act"
        },
        {
            "rule_id": "police_seize_keys",
            "domain": "Police",
            "topic": "Traffic",
            "summary": "Traffic police cannot seize your vehicle keys.",
            "verdict": "CANNOT",
            "conditions": [],
            "exceptions": [
                "If you are trying to flee or the vehicle is being impounded for a crime."
            ],
            "simple_explanation": "A traffic policeman does not have the right to forcefully take your car or bike keys to stop you. This is illegal.",
            "detailed_explanation": "No provision in the Motor Vehicles Act authorizes the seizure of keys. It is often considered harassment.",
            "examples": [
                "Cop snatches bike keys at a signal."
            ],
            "what_to_say": "Please do not remove my keys. I am cooperating and not fleeing. You can note my details.",
            "next_steps": [
                "ðŸš« Politely refuse - Say 'You cannot seize my keys. Please issue challan if there's violation.'",
                "ðŸ“ Note officer details - Name, badge number, police station - for complaint if keys forcefully taken.",
                "ðŸŽ¥ Record if safe - Video record the interaction (keep phone recording from pocket if risky).",
                "ðŸ“ž Call someone - Have a friend/family on call as witness to the situation.",
                "ðŸ’° Don't pay bribe - Officer asking for keys usually wants bribe. Refuse and insist on official challan.",
                "ðŸ“§ File complaint - If keys seized, immediately file complaint at police station or online portal.",
                "âš–ï¸ Know your rights - Key seizure is NOT authorized under Motor Vehicles Act; it's harassment.",
                "ðŸ›ï¸ Approach court - If vehicle detained illegally, file writ petition for its immediate release."
            ],
            "source_category": "Motor Vehicles Act Implementation"
        },
        {
            "rule_id": "police_lawyer_right",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "You have the right to a lawyer immediately upon arrest.",
            "verdict": "CAN",
            "conditions": [
                "Must be allowed to contact a lawyer of your choice.",
                "If you cannot afford one, state must provide legal aid."
            ],
            "exceptions": [
                "None. This is a fundamental right under Article 22."
            ],
            "simple_explanation": "The moment you are arrested, you have the right to call a lawyer. Police cannot deny this or interrogate you without legal counsel if you request it.",
            "detailed_explanation": "Article 22(1) guarantees the right to consult and be defended by a legal practitioner of your choice. D.K. Basu guidelines reinforce this.",
            "examples": [
                "Police say 'No lawyer until tomorrow'.",
                "Interrogation starts before lawyer arrives."
            ],
            "what_to_say": "I wish to exercise my right to legal counsel. I will not answer questions until my lawyer is present.",
            "next_steps": [
                "ðŸ“ž Call lawyer immediately - Use your one phone call wisely; call a lawyer or family who can arrange one.",
                "ðŸ¤ Exercise right to silence - Say 'I want to speak to my lawyer first' and then stay silent.",
                "ðŸš« Don't sign anything - Never sign statements, confessions, or blank papers without lawyer review.",
                "ðŸ“ Request legal aid - If you can't afford lawyer, demand state-provided legal aid (it's your constitutional right).",
                "â° No questioning without lawyer - Police cannot legally interrogate you after you've invoked lawyer right.",
                "ðŸ“‹ Know your rights - Right to lawyer is under Article 22(1); violation can get case dismissed.",
                "ðŸ›ï¸ Demand magistrate - If police deny lawyer access, demand to be produced before magistrate immediately.",
                "ðŸ“§ File complaint - If lawyer access denied, your lawyer should file habeas corpus petition in High Court."
            ],
            "source_category": "Constitution Article 22 / CrPC"
        },
        {
            "rule_id": "police_fir_mandatory",
            "domain": "Police",
            "topic": "FIR",
            "summary": "Police cannot refuse to register an FIR for cognizable offenses.",
            "verdict": "CANNOT",
            "conditions": [
                "For cognizable offenses (murder, theft, rape, etc.), FIR is mandatory.",
                "Must be registered at any police station (jurisdiction doesn't matter initially)."
            ],
            "exceptions": [
                "Non-cognizable offenses require magistrate permission.",
                "Clearly false/frivolous complaints can be rejected."
            ],
            "simple_explanation": "If a serious crime has occurred, police MUST register your FIR. They cannot send you away saying 'not our jurisdiction' or 'come tomorrow'.",
            "detailed_explanation": "Section 154 CrPC makes it mandatory for police to register FIR for cognizable offenses. Refusal is a punishable offense for the officer.",
            "examples": [
                "Police say 'This happened in another area, go there'.",
                "Officer says 'Settle it among yourselves'."
            ],
            "what_to_say": "As per Section 154 CrPC, you are legally bound to register my complaint. Please do so immediately or I will escalate this.",
            "next_steps": [
                "ðŸ“ Demand FIR in writing - Say 'I want to file FIR under Section 154 CrPC. Please register it.'",
                "ðŸ“§ Send written complaint - Email your complaint to SHO, SP, and DGP with all details (creates legal record).",
                "ðŸ“‹ Get acknowledgment - Insist on receiving FIR copy with FIR number immediately after filing.",
                "ðŸ“ž Call helpline - If refused, call police control room 100 or state police complaint number.",
                "ðŸ›ï¸ Approach Magistrate - If police refuse, directly approach local Magistrate and file complaint (u/s 156(3) CrPC).",
                "ðŸ“± Online FIR - Many states allow online FIR filing for certain offenses; check your state police website.",
                "âš–ï¸ File complaint against officer - Refusing to register FIR is misconduct; file complaint against the officer with SP.",
                "ðŸŽ¥ Record refusal - If safe, record the officer refusing to file FIR (strong evidence for legal action)."
            ],
            "source_category": "CrPC Section 154"
        },
        {
            "rule_id": "police_bribe_illegal",
            "domain": "Police",
            "topic": "Traffic",
            "summary": "Offering or accepting bribes is illegal for both parties.",
            "verdict": "CANNOT",
            "conditions": [
                "Police cannot demand bribe.",
                "You should not offer bribe either (you become complicit)."
            ],
            "exceptions": [
                "If you record the bribe demand, you can report it."
            ],
            "simple_explanation": "If a cop asks for money to let you go, that's illegal. But if you willingly pay, you are also breaking the law. Better to take the challan.",
            "detailed_explanation": "Prevention of Corruption Act makes bribery by public servants a crime. Citizens offering bribes can also be prosecuted unless they report it.",
            "examples": [
                "Traffic cop says 'Give â‚¹500 or I'll seize your vehicle'."
            ],
            "what_to_say": "I would prefer to pay the official fine through proper channels. Please issue me a challan.",
            "next_steps": [
                "ðŸš« Never offer bribe - Offering bribe makes YOU guilty too under Prevention of Corruption Act.",
                "ðŸ“ Always demand challan - Say 'Please issue me official challan. I will pay online/at court.'",
                "ðŸŽ¥ Record if demanded - If officer asks for bribe, discreetly record it (audio/video evidence).",
                "ðŸ“ž Note details - Officer name, badge number, vehicle number, time, location.",
                "ðŸ’° Know fine amounts - Check actual fine for your offense online to avoid overpaying.",
                "ðŸ“± Report on app - Use 'I Paid a Bribe' app or state anti-corruption helpline to report bribe demand.",
                "âš–ï¸ File complaint - Report to Anti-Corruption Bureau (ACB) or Lokayukta within 24 hours with evidence.",
                "ðŸ›ï¸ Legal action - Bribe-taking police can face jail time; your complaint can lead to departmental action."
            ],
            "source_category": "Prevention of Corruption Act"
        },
        {
            "rule_id": "police_body_search",
            "domain": "Police",
            "topic": "Search",
            "summary": "Body searches must follow strict procedures.",
            "verdict": "CAN",
            "conditions": [
                "Female suspects can only be searched by female officers.",
                "Must be done in presence of a female family member or respectable woman.",
                "Dignity must be maintained."
            ],
            "exceptions": [
                "Emergency situations with senior officer approval."
            ],
            "simple_explanation": "Police can conduct body searches, but for women, it MUST be done by a female officer in a private place with another woman present.",
            "detailed_explanation": "Section 51 CrPC mandates strict procedures for body searches to prevent harassment and maintain decency.",
            "examples": [
                "Male officer attempts to search a woman.",
                "Search done in public view."
            ],
            "what_to_say": "As per the CrPC, a female officer must conduct this search in a private place. Please arrange for that.",
            "next_steps": [
                "âœ‹ Assert your rights - Say 'Only female officer can search me, in private, with another woman present.'",
                "ðŸš« Refuse male officer - DO NOT allow male officer to search you under any circumstance.",
                "ðŸ“± Call family/female friend - Ask them to come as witness for the search procedure.",
                "ðŸ“ Demand privacy - Search must be in a closed room/private space, never in public view.",
                "ðŸŽ¥ Note violations - If improper search done, note officer names and file complaint immediately.",
                "ðŸ“ž Call women's helpline - Dial 1091 or 181 for immediate support if being harassed.",
                "ðŸ›ï¸ File FIR if violated - Improper body search is sexual harassment; file FIR under IPC Section 354.",
                "âš–ï¸ Seek compensation - You can file case for damages and compensation for dignity violation."
            ],
            "source_category": "CrPC Section 51"
        },
        {
            "rule_id": "doc_contract_lockin",
            "domain": "Documents",
            "topic": "Contract",
            "summary": "Lock-in periods must be reasonable.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Lock-in clauses must not be 'one-sided' or 'unconscionable'.",
                "Penalty should reflect actual loss."
            ],
            "exceptions": [
                "Commercial leases often have stricter valid lock-ins."
            ],
            "simple_explanation": "If a contract says you cannot leave for 3 years or must pay a huge fine, it might be unfair. Courts often strike down penalties that are not genuine estimates of loss.",
            "detailed_explanation": "One-sided clauses where only the employee/tenant is bound are often considered 'unfair trade practices' or void under Contract Act principles.",
            "examples": [
                "Gym membership says no refund and 1 year lock-in even if you move cities."
            ],
            "what_to_say": "This lock-in clause seems one-sided. I am willing to give reasonable notice, but a huge penalty is likely not enforceable.",
            "source_category": "Indian Contract Act / Consumer Protection"
        },
        {
            "rule_id": "landlord_deposit_refund",
            "domain": "Documents",
            "topic": "Rent",
            "summary": "Landlord must refund deposit within reasonable time.",
            "verdict": "CANNOT",
            "conditions": [
                "Deductions must be for actual damage, not 'wear and tear'.",
                "Refund usually due upon handing over keys."
            ],
            "exceptions": [
                "Unpaid rent can be deducted."
            ],
            "simple_explanation": "A landlord cannot keep your security deposit without a valid reason. They can deduct for broken items but not for painting or normal usage marks.",
            "detailed_explanation": "Tenancy agreements and Model Tenancy guidelines allow deduction only for 'damages' beyond normal wear and tear. Painting charges are usually landlord's responsibility unless agreed otherwise.",
            "examples": [
                "Landlord deducts full deposit for 'painting' after you leave."
            ],
            "what_to_say": "Please provide the bills for the damages you are claiming. Normal wear and tear is not valid for deduction.",
            "next_steps": [
                "ðŸ“¸ Take photos before leaving - Document the property condition (date-stamped photos/videos).",
                "ðŸ“§ Send move-out notice - Email landlord about vacating with expected move-out date.",
                "ðŸ“ Demand itemized deductions - Ask landlord to provide detailed bill for any damage claimed.",
                "ðŸ’° Know what's deductible - Only actual damages (broken items, deep stains) not painting, minor wear.",
                "âš–ï¸ Send legal notice - If deposit not returned in 30 days, send lawyer's notice.",
                "ðŸ›ï¸ File civil suit - Approach Small Causes Court for deposit + interest + compensation for harassment.",
                "ðŸ“ž Call police (if threats) - If landlord threatens or harasses, call police.",
                "ðŸ“‹ Keep proof - Rent receipts, lease agreement, deposit receipt, move-in/out photos - essential evidence."
            ],
            "source_category": "Model Tenancy Act / Contract"
        },
        {
            "rule_id": "rent_eviction_notice",
            "domain": "Documents",
            "topic": "Rent",
            "summary": "Landlord cannot evict you without notice.",
            "verdict": "CANNOT",
            "conditions": [
                "Usually requires 1 month notice (or as per agreement).",
                "Cannot forcefully throw your things out."
            ],
            "exceptions": [
                "Court order for eviction."
            ],
            "simple_explanation": "Your landlord cannot tell you to leave 'today' or throw your belongings out. They must follow the legal process and give proper notice.",
            "detailed_explanation": "Rent control laws and the Transfer of Property Act require valid notice for termination of tenancy. Forced eviction without due process is illegal.",
            "examples": [
                "Landlord asks you to vacate in 24 hours."
            ],
            "what_to_say": "I am entitled to proper legal notice as per our agreement/law. Immediate eviction is illegal.",
            "next_steps": [
                "ðŸ“§ Check your lease - See what notice period is mentioned in rental agreement.",
                "ðŸš« Refuse to vacate - Legally, landlord cannot evict without proper notice (usually 1-3 months).",
                "ðŸ“‹ Demand written notice - Ask landlord to provide eviction notice in writing with reason and date.",
                "ðŸ‘® Call police if forced - If landlord tries to forcefully evict or throws belongings out, call 100.",
                "âš–ï¸ Know your rights - Landlord needs court order for forceful eviction; self-help not allowed.",
                "ðŸ›ï¸ File injunction - Approach civil court for injunction against illegal eviction.",
                "ðŸ“ž File police complaint - Forceful eviction is criminal trespass; file FIR.",
                "ðŸ“± Record harassment - Document all threats, messages for legal evidence."
            ],
            "source_category": "Rent Control Act / Transfer of Property Act"
        },
        {
            "rule_id": "landlord_entry_permission",
            "domain": "Documents",
            "topic": "Privacy",
            "summary": "Landlord cannot enter rented property without permission.",
            "verdict": "CANNOT",
            "conditions": [
                "Must give reasonable notice (24-48 hours).",
                "Can only enter for repairs/inspection with consent."
            ],
            "exceptions": [
                "Emergency situations (fire, flood, etc.)."
            ],
            "simple_explanation": "Once you rent a place, it's your home. The landlord cannot just walk in whenever they want. They need your permission except in emergencies.",
            "detailed_explanation": "The tenant has exclusive possession rights. Unauthorized entry violates privacy and can be considered trespass.",
            "examples": [
                "Landlord uses spare key to enter when you're not home.",
                "Shows up unannounced for 'inspection'."
            ],
            "what_to_say": "As per our rental agreement, you need to inform me 24 hours in advance before entering. Please respect my privacy.",
            "next_steps": [
                "ðŸš« Change locks if needed - If landlord has copy and enters without permission, change locks (inform them).",
                "ðŸ“§ Send written notice - Email stating 'You must give 24-48 hours notice before entry as per tenancy norms.'",
                "ðŸ“‹ Check lease agreement - See if entry conditions are mentioned; if not, standard law applies.",
                "ðŸ“± Install camera (if allowed) - For your safety, install small camera at entrance (inform landlord).",
                "ðŸ‘® Call police if trespassing - If landlord enters forcefully or repeatedly without notice, file complaint.",
                "âš–ï¸ Know your rights - Once rented, you have 'exclusive possession'; unauthorized entry is trespass.",
                "ðŸ›ï¸ File case if continues - Can file for injunction + damages for privacy violation.",
                "ðŸ“ž Record instances - Note down each unauthorized entry with date/time for legal record."
            ],
            "source_category": "Transfer of Property Act / Trespass Law"
        },
        {
            "rule_id": "consumer_no_refund",
            "domain": "Documents",
            "topic": "Consumer",
            "summary": "No Refund policies are often illegal.",
            "verdict": "CANNOT",
            "conditions": [
                "If service was deficient or product defective.",
                "Absolute 'No Refund' boards are void."
            ],
            "exceptions": [
                "Perishable goods or custom-made items."
            ],
            "simple_explanation": "Shops cannot simply say 'No Exchange/No Refund'. If the product is defective, they MUST repair, replace, or refund it.",
            "detailed_explanation": "Consumer Protection Act classes absolute restrictive trade practices as illegal. Consumers have a right to redressal for defective goods.",
            "examples": [
                "Bought a shirt, zipper is broken, shop says 'No Refund'."
            ],
            "what_to_say": "As a consumer, I am entitled to a replacement or refund for a defective product. 'No Refund' policies do not override the law.",
            "next_steps": [
                "ðŸ“‹ Keep all proof - Bill, warranty card, product photos, defect evidence.",
                "ðŸ“§ Send written complaint - Email/letter to shop manager describing defect and demanding replacement/refund.",
                "ðŸ“ž Follow up in 7 days - If no response, call and email again creating paper trail.",
                "âš–ï¸ Know your rights - Consumer Protection Act gives you right to replacement/refund for defective goods.",
                "ðŸ›ï¸ File consumer complaint - Go to National Consumer Helpline 1800-11-4000 or consumerhelpline.gov.in.",
                "ðŸ“± Online complaint - File at edaakhil.nic.in (e-Daakhil portal) for consumer disputes.",
                "ðŸ“‹ Approach Consumer Forum - For disputes up to â‚¹1 lakh: District Forum; above: State/National Commission.",
                "ðŸ’° Claim compensation - Can get refund + compensation for deficiency of service + legal costs."
            ],
            "source_category": "Consumer Protection Act, 2019"
        },
        {
            "rule_id": "consumer_mrp_violation",
            "domain": "Documents",
            "topic": "Shopping",
            "summary": "Shops cannot sell above MRP.",
            "verdict": "CANNOT",
            "conditions": [
                "MRP is the maximum retail price.",
                "Includes all taxes."
            ],
            "exceptions": [
                "Hotels/restaurants can charge above MRP (service tax applies)."
            ],
            "simple_explanation": "If a product has MRP printed on it, the shop cannot charge more than that amount. Charging above MRP is illegal.",
            "detailed_explanation": "Legal Metrology Act makes it mandatory to sell at or below MRP. Violations can be penalized heavily.",
            "examples": [
                "Shop charges â‚¹120 for item with MRP â‚¹100.",
                "Cinema charges extra for water bottle."
            ],
            "what_to_say": "The MRP printed on this product is â‚¹X. You cannot charge more than that. Please adjust the bill.",
            "next_steps": [
                "ðŸš« Refuse to pay excess - Politely but firmly say 'MRP is â‚¹X, I will pay only that.'",
                "ðŸ“¸ Take photo of MRP - Capture MRP tag and bill showing overcharge as evidence.",
                "ðŸ“§ Report to legal metrology - File complaint at state legal metrology department.",
                "ðŸ“ž Call consumer helpline - Dial 1800-11-4000 to report MRP violation.",
                "ðŸ“± Use app - Download 'Legal Metrology App' and file complaint instantly.",
                "ðŸ’° Know penalties - Shop can be fined up to â‚¹25,000; repeat offense: â‚¹1 lakh + imprisonment.",
                "ðŸ›ï¸ File consumer case - Can approach consumer forum for refund of excess + compensation.",
                "ðŸ–Šï¸ Social media - Tag @MinOfCA (Ministry of Consumer Affairs) on Twitter to escalate."
            ],
            "source_category": "Legal Metrology Act, 2009"
        },
        {
            "rule_id": "flight_cancellation",
            "domain": "Documents",
            "topic": "Flight",
            "summary": "Airlines must compensate for flight delays and cancellations.",
            "verdict": "CAN",
            "conditions": [
                "Domestic: â‚¹5000 for delays > 3 hours, â‚¹10000 for cancellations.",
                "Must be informed 2 weeks in advance to avoid compensation."
            ],
            "exceptions": [
                "Extraordinary circumstances (weather, security) exempt airlines.",
                "If alternate flight is arranged within 1 hour."
            ],
            "simple_explanation": "If your flight is delayed or cancelled without proper notice, the airline owes you compensation plus hotel/meals if needed.",
            "detailed_explanation": "DGCA Civil Aviation Requirements mandate compensation for delays, cancellations, and denied boarding due to overbooking.",
            "examples": [
                "Flight cancelled 2 hours before departure with no reason."
            ],
            "what_to_say": "As per DGCA regulations, I am entitled to compensation for this delay/cancellation. Please issue it immediately or provide written reasons.",
            "next_steps": [
                "ðŸ“§ Email airline immediately - Send complaint to airline's customer service with flight details.",
                "ðŸ“‹ Collect evidence - Boarding pass, tickets, delay announcement, airport display photos.",
                "ðŸ’° Know compensation amount - Domestic: â‚¹5,000 (delay >3hrs), â‚¹10,000 (cancellation within 2 weeks).",
                "ðŸ“ž Call airline - Speak to ground staff/customer service for immediate hotel/meal arrangements if overnight delay.",
                "ðŸ›ï¸ File complaint with DGCA - If airline refuses, go to airlinefeedback.dgca.gov.in to file complaint.",
                "ðŸ“± AirSewa app/portal - Government app for immediate redressal of flight issues.",
                "âš–ï¸ Approach consumer forum - File case in consumer court for compensation + harassment damages.",
                "ðŸ’¼ Claim from employer - If business trip, submit claim to employer and let them handle with airline."
            ],
            "source_category": "DGCA CAR, Section 3"
        },
        {
            "rule_id": "cybercrime_reporting",
            "domain": "Police",
            "topic": "Cybercrime",
            "summary": "You can report cybercrimes online and to local police.",
            "verdict": "CAN",
            "conditions": [
                "Report to cybercrime.gov.in or local cyber cell.",
                "FIR mandatory for serious crimes like hacking, fraud."
            ],
            "exceptions": [
                "Minor issues can be flagged to platform (Twitter, Instagram)."
            ],
            "simple_explanation": "If someone hacks your account, leaks your photos, or scams you online, you can file a complaint with the cyber cell. It's a legal offense.",
            "detailed_explanation": "IT Act, 2000 covers cybercrimes like hacking, identity theft, and online harassment. Penalties include jail time.",
            "examples": [
                "Someone creates fake profile using your photos.",
                "Online shopping fraud."
            ],
            "what_to_say": "I want to file a cybercrime complaint. Here are the screenshots and evidence.",
            "source_category": "IT Act, 2000"
        },
        {
            "rule_id": "drunk_driving",
            "domain": "Police",
            "topic": "Alcohol",
            "summary": "Drunk driving is illegal and police can conduct breathalyzer tests.",
            "verdict": "CAN",
            "conditions": [
                "Blood alcohol limit: 30 mg per 100 ml.",
                "Police can test if they suspect drunk driving."
            ],
            "exceptions": [
                "You can request a blood test if you dispute breathalyzer."
            ],
            "simple_explanation": "Driving under the influence is illegal. If caught, you can face heavy fines, license suspension, and even jail time.",
            "detailed_explanation": "Motor Vehicles Act Section 185 criminalizes drunk driving with penalties up to â‚¹10,000 and 6 months jail for first offense.",
            "examples": [
                "Stopped at checkpoint and breathalyzer shows positive."
            ],
            "what_to_say": "I understand the law. If I test positive, please follow due process and I'd like to see the calibration certificate of the device.",
            "source_category": "Motor Vehicles Act, Section 185"
        },
        {
            "rule_id": "minor_detention",
            "domain": "Police",
            "topic": "Arrest",
            "summary": "Juveniles (under 18) have special protections.",
            "verdict": "CANNOT",
            "conditions": [
                "Cannot be kept in police lockup with adults.",
                "Must be sent to Juvenile Justice Board within 24 hours.",
                "Parents/guardians must be informed immediately."
            ],
            "exceptions": [
                "Heinous crimes may have different procedures (tried as adult in some cases)."
            ],
            "simple_explanation": "If you are under 18, police cannot treat you like an adult offender. You must be kept separate and produced before a special board, not a regular court.",
            "detailed_explanation": "Juvenile Justice Act, 2015 provides special treatment, rehabilitation focus, and strict procedural safeguards for minors.",
            "examples": [
                "17-year-old kept in adult lockup overnight."
            ],
            "what_to_say": "I am a minor. As per the JJ Act, I must be produced before the Juvenile Justice Board and my parents must be informed.",
            "source_category": "Juvenile Justice Act, 2015"
        },
        {
            "rule_id": "online_fraud",
            "domain": "Police",
            "topic": "Cybercrime",
            "summary": "Online fraud victims can report and potentially recover money.",
            "verdict": "CAN",
            "conditions": [
                "Report within 24 hours for best chance of recovery.",
                "File complaint at cybercrime.gov.in and local police."
            ],
            "exceptions": [
                "If money transferred outside India, recovery is harder."
            ],
            "simple_explanation": "If you fall victim to UPI fraud, fake shopping sites, or phishing, report immediately. Police can freeze the fraudster's account if you act fast.",
            "detailed_explanation": "National Cyber Crime Reporting Portal connects to banks and can freeze suspicious accounts within hours if reported quickly.",
            "examples": [
                "Clicked phishing link, â‚¹50,000 debited from account."
            ],
            "what_to_say": "I've been defrauded online. Here's the transaction ID and fraudster's account details. Please freeze the account immediately.",
            "source_category": "IT Act / IPC Sections 419, 420"
        },
        {
            "rule_id": "illegal_towing",
            "domain": "Police",
            "topic": "Towing",
            "summary": "Vehicle can only be towed for specific violations with proper procedure.",
            "verdict": "CAN",
            "conditions": [
                "Must be in no-parking zone or obstructing traffic.",
                "Receipt must be issued with recovery location."
            ],
            "exceptions": [
                "Emergency clearance for ambulance/fire brigade path."
            ],
            "simple_explanation": "Police or traffic authorities can tow your vehicle if it's illegally parked, but they must give you a proper receipt and tell you where to collect it.",
            "detailed_explanation": "Motor Vehicles Act allows towing but mandates documentation. Arbitrary towing or extortion for release is illegal.",
            "examples": [
                "Car towed from regular parking spot without notice."
            ],
            "what_to_say": "Why was my vehicle towed? Please provide the official receipt and penalty details as per the MV Act.",
            "source_category": "Motor Vehicles Act"
        },
        {
            "rule_id": "hr_probation_extension",
            "domain": "Workplace",
            "topic": "Termination",
            "summary": "Employers can extend probation but must follow rules.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Extension must be communicated in writing with valid reasons.",
                "Total probation period should not exceed what's reasonable (typically 6 months max)."
            ],
            "exceptions": [
                "If contract allows for specific extension period.",
                "Performance-based extension with clear improvement plan."
            ],
            "simple_explanation": "Your employer can extend your probation period, but they must inform you in writing with specific reasons. Indefinite or repeated extensions without valid cause are unfair.",
            "detailed_explanation": "While probation extensions are permitted, courts have held that unreasonable or indefinite extensions amount to exploitation. Extensions must be justified, documented, and limited in duration.",
            "examples": [
                "Company extends probation for 3rd time without clear reasons.",
                "Employer extends probation indefinitely saying 'performance needs improvement' without specifics."
            ],
            "what_to_say": "I would like to understand the specific reasons for the extension and what performance criteria I need to meet for confirmation.",
            "next_steps": [
                "ðŸ“§ Request written explanation - Ask HR for formal email stating reasons for extension and duration.",
                "ðŸ“‹ Ask for clear goals - Request specific, measurable performance targets for confirmation.",
                "ðŸ“ Document everything - Keep all performance reviews, emails, and work achievements.",
                "ðŸ’¬ Schedule meeting with manager - Discuss concerns and get clarity on expectations.",
                "â° Set timeline - If extended, ensure there's a clear end date and review process.",
                "âš–ï¸ Know your rights - Extensions beyond 6 months total may be challengeable as unfair labor practice.",
                "ðŸ” Review contract - Check what your appointment letter says about probation duration.",
                "ðŸ’¼ Consider options - If extension seems unreasonable, you may want to look for other opportunities."
            ],
            "source_category": "Industrial Employment Act / Contract Law"
        },
        {
            "rule_id": "hr_appraisal_denial",
            "domain": "Workplace",
            "topic": "Salary",
            "summary": "Companies can deny appraisal but must have valid process.",
            "verdict": "CAN",
            "conditions": [
                "Denial must be based on documented performance issues.",
                "Company must follow their stated appraisal policy.",
                "Cannot be discriminatory or arbitrary."
            ],
            "exceptions": [
                "If company-wide freeze due to financial crisis (must apply to all).",
                "If you joined recently and haven't completed minimum tenure."
            ],
            "simple_explanation": "Your company can deny an appraisal/increment, but it should be based on fair performance evaluation, not favoritism or discrimination. They must follow their own policies.",
            "detailed_explanation": "While increment is not a legal right, companies must follow their own policies and cannot deny raises arbitrarily or discriminatorily. Performance-based denial must be documented.",
            "examples": [
                "You get 'meets expectations' rating but no increment while others do.",
                "Boss says 'no increment this year' without any appraisal process."
            ],
            "what_to_say": "I would like to understand the appraisal process and criteria. Can you share my performance evaluation and how the decision was made?",
            "next_steps": [
                "ðŸ“§ Request performance review - Ask for written feedback on your performance rating.",
                "ðŸ“Š Gather evidence - Collect achievements, project completions, positive emails from clients/managers.",
                "ðŸ“‹ Check company policy - Review employee handbook for appraisal policy and cycle.",
                "ðŸ’¬ Schedule one-on-one - Meet with manager to discuss performance and areas of improvement.",
                "ðŸ” Compare peers - If similar performers got increments, document this (without violating privacy).",
                "ðŸ“ Document conversation - Keep records of all discussions about appraisal denial.",
                "âš–ï¸ Escalate if unfair - If denial seems discriminatory, raise with HR or skip-level manager.",
                "ðŸ’¼ Evaluate market - Consider external opportunities if company consistently undervalues you."
            ],
            "source_category": "Employment Contract / Service Conditions"
        },
        {
            "rule_id": "hr_relocation_forced",
            "domain": "Workplace",
            "topic": "Termination",
            "summary": "Forced relocation depends on your contract.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "If contract mentions 'transferable' or 'willing to relocate', company can transfer you.",
                "Employer must give reasonable notice (30-60 days typically).",
                "Cannot be used as punishment or to force resignation."
            ],
            "exceptions": [
                "If you have location-specific hiring (contract says 'Mumbai office').",
                "Medical/family emergency making relocation impossible."
            ],
            "simple_explanation": "If your contract says you're transferable, the company can ask you to relocate. But they must give proper notice and cannot use it to harass you. If contract specifies a location, forced transfer may be illegal.",
            "detailed_explanation": "Transfer rights depend on employment contract terms. Courts protect employees from arbitrary transfers used to force resignation, especially if contract specifies location or if transfer causes undue hardship.",
            "examples": [
                "Contract says 'Delhi based' but company suddenly transfers you to Chennai in 15 days.",
                "Boss transfers you as 'punishment' for raising complaint."
            ],
            "what_to_say": "I need to review my contract regarding transfer terms. Can we discuss the business justification and timeline for this relocation?",
            "next_steps": [
                "ðŸ“„ Check your contract - Look for 'transferable', 'location', or 'relocation' clauses in appointment letter.",
                "ðŸ“§ Request written transfer order - Ask for formal order with reason, location, joining date.",
                "ðŸ’¬ Negotiate timeline - Request adequate notice period (60-90 days) to make arrangements.",
                "ðŸ“‹ Ask for relocation benefits - Inquire about packing/moving allowance, accommodation, family support.",
                "âš–ï¸ Know your rights - If contract is location-specific, forced transfer may be illegal.",
                "ðŸ’¼ Document hardship - If transfer causes extreme hardship (medical, family issues), present documentation.",
                "ðŸ—£ï¸ Escalate concerns - If transfer seems punitive or discriminatory, raise with HR/senior management.",
                "ðŸŽ¯ Consider alternatives - Discuss remote work, gradual transition, or alternate role in current location."
            ],
            "source_category": "Industrial Employment Act / Contract Law"
        },
        {
            "rule_id": "hr_wfh_denial",
            "domain": "Workplace",
            "topic": "Leave",
            "summary": "Work from home is generally at employer's discretion.",
            "verdict": "CAN",
            "conditions": [
                "Unless contract guarantees WFH, company can deny it.",
                "Must apply policy uniformly (cannot allow some and deny others arbitrarily)."
            ],
            "exceptions": [
                "Medical emergency with doctor's certificate.",
                "Disability requiring accommodation.",
                "Maternity/paternity period as per law."
            ],
            "simple_explanation": "Work from home is usually the employer's decision unless your contract specifically guarantees it. However, they cannot deny it discriminatorily or during medical emergencies.",
            "detailed_explanation": "Post-pandemic, WFH remains at employer's discretion unless contractually guaranteed. However, disabled employees may claim WFH as reasonable accommodation under Rights of Persons with Disabilities Act.",
            "examples": [
                "You have medical certificate for bed rest but company insists on office attendance.",
                "Company allows WFH to some teams but randomly denies your request."
            ],
            "what_to_say": "I understand the policy. However, given my situation [medical/family emergency], can we explore a temporary WFH arrangement?",
            "next_steps": [
                "ðŸ“‹ Check company policy - Review  WFH/flexible work policy in employee handbook.",
                "ðŸ“§ Formal request - Send written request with valid justification (medical, caregiving, etc.).",
                "ðŸ¥ Provide documentation - Attach doctor's certificate, medical reports if health-related.",
                "ðŸ’¬ Propose trial period - Suggest WFH for specific duration with performance review.",
                "ðŸ“Š Show productivity - Present data on how you can maintain/improve output from home.",
                "âš–ï¸ Know your rights - If you're disabled, you may claim WFH as reasonable accommodation.",
                "ðŸ¤ Negotiate hybrid - If full WFH denied, request hybrid model (2-3 days/week from home).",
                "ðŸ’¼ Evaluate options - If WFH is critical for you, consider roles/companies offering this flexibility."
            ],
            "source_category": "Employment Contract / Workplace Policy"
        },
        {
            "rule_id": "hr_medical_leave_denial",
            "domain": "Workplace",
            "topic": "Leave",
            "summary": "Employers cannot deny genuine medical leave with proper proof.",
            "verdict": "CANNOT",
            "conditions": [
                "You must provide doctor's certificate/medical proof.",
                "Should inform employer as soon as possible.",
                "Leave balance should be available (if paid leave)."
            ],
            "exceptions": [
                "If you've exhausted all medical leave quota, may be unpaid.",
                "Suspicious patterns (always sick on Mondays/Fridays) may require additional verification."
            ],
            "simple_explanation": "If you're genuinely sick with doctor's certificate, your employer cannot deny medical leave. For short illness (1-2 days), most companies allow self-declaration. Longer illness requires medical certificate.",
            "detailed_explanation": "Medical leave is a fundamental right. Shops & Establishments Act mandates sick leave provision. Denying genuine medical leave violates employee welfare and can be challenged.",
            "examples": [
                "You submit doctor's certificate for dengue but manager says 'we're short-staffed, you must come'.",
                "Company threatens salary deduction for medical leave despite having leave balance."
            ],
            "what_to_say": "I have a genuine medical condition certified by my doctor. I will share the medical certificate and need to take leave as advised for my recovery.",
            "next_steps": [
                "ðŸ¥ Get medical certificate - Visit doctor and obtain formal certificate with diagnosis and rest period.",
                "ðŸ“§ Inform immediately - Send email/message to manager and HR about illness and expected leave duration.",
                "ðŸ“‹ Submit leave application - Fill formal leave form as per company process.",
                "ðŸ“„ Attach documentation - Send scanned copy of medical certificate with leave application.",
                "ðŸ“ž Keep communication open - Update manager if leave needs extension based on doctor's advice.",
                "âš–ï¸ Know your rights - Medical leave denial despite valid proof can be challenged with Labour Commissioner.",
                "ðŸ“ Document everything - Keep copies of medical certificates, leave applications, and responses.",
                "ðŸ’¼ Check leave policy - Review your leave balance and company's medical leave policy."
            ],
            "source_category": "Shops & Establishments Act / Leave Policy"
        },
        {
            "rule_id": "hr_salary_deduction_unauthorized",
            "domain": "Workplace",
            "topic": "Salary",
            "summary": "Unauthorized salary deductions are illegal.",
            "verdict": "CANNOT",
            "conditions": [
                "Deductions only allowed for: PF, taxes, authorized absences, loan repayment (with consent).",
                "Fines/penalties must be as per Standing Orders and with proper inquiry."
            ],
            "exceptions": [
                "Recovery of advance/loan taken by you.",
                "Court-ordered deductions (child support, debt recovery)."
            ],
            "simple_explanation": "Your employer cannot randomly deduct money from your salary. Deductions must be authorized by law (taxes, PF) or by you (loans), or due to proven misconduct after proper inquiry.",
            "detailed_explanation": "Payment of Wages Act strictly regulates salary deductions. Unauthorized deductions for damages, shortages, or as penalties without due process are illegal and punishable.",
            "examples": [
                "Company deducts â‚¹5,000 saying 'project quality was poor' without any investigation.",
                "Employer cuts salary for 'office property damage' you didn't cause."
            ],
            "what_to_say": "I notice unauthorized deductions in my salary. Please provide written explanation with legal basis for these deductions.",
            "next_steps": [
                "ðŸ“§ Request pay slip breakdown - Ask HR for detailed salary slip showing all deductions with reasons.",
                "ðŸ“‹ Review deductions - Check which deductions were authorized by you vs imposed by company.",
                "ðŸ’¬ Question unauthorized cuts - Send email questioning any deduction not explained or not authorized.",
                "ðŸ“„ Check appointment letter - Review what deductions were mentioned in your contract.",
                "âš–ï¸ Know your rights - Under Payment of Wages Act, only specific deductions are permitted.",
                "ðŸ“ž Escalate to HR - If manager made arbitrary deduction, escalate to HR/payroll team.",
                "ðŸ›ï¸ File complaint - If not resolved, file complaint with Labour Commissioner for illegal deduction.",
                "ðŸ’° Demand refund - You can claim back any illegally deducted amount with interest."
            ],
            "source_category": "Payment of Wages Act, 1936"
        },
        {
            "rule_id": "hr_background_verification_delay",
            "domain": "Workplace",
            "topic": "Termination",
            "summary": "Companies can verify background but cannot indefinitely delay joining.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Background verification must be completed within reasonable time (30-45 days typically).",
                "Cannot keep you waiting indefinitely without updates."
            ],
            "exceptions": [
                "Delays due to previous employer not responding (not new employer's fault).",
                "Police verification in sensitive sectors may take longer."
            ],
            "simple_explanation": "Background verification is standard, but companies must complete it in reasonable time. If it's taking too long due to their delays, you can escalate or join elsewhere.",
            "detailed_explanation": "While employers have right to verify credentials, unreasonable delays causing loss of employment opportunity may be challengeable. Offer letters typically mention tentative joining subject to verification.",
            "examples": [
                "Company keeps you waiting 3 months for background check without updates.",
                "You missed other offers waiting for BGV that keeps getting delayed."
            ],
            "what_to_say": "I understand the need for background verification. However, can you provide a timeline for completion? I have made commitments based on the offer.",
            "next_steps": [
                "ðŸ“§ Follow up regularly - Email HR every week asking for status update on BGV.",
                "ðŸ“‹ Offer to help - Provide additional documents, contact details if needed to speed up process.",
                "â° Set reasonable deadline - Politely mention you need closure within X weeks.",
                "ðŸ“„ Review offer letter - Check if it mentions specific BGV timeline or conditions.",
                "ðŸ’¬ Understand delays - Ask specifically what's causing delay and if you can assist.",
                "ðŸŽ¯ Keep other options open - Don't reject other offers until this one is confirmed.",
                "âš–ï¸ Know your rights - Unreasonable BGV delays causing loss can be grounds for complaint.",
                "ðŸ’¼ Document everything - Keep all offer letters, emails, and communication for records."
            ],
            "source_category": "Employment Contract / Recruitment Practices"
        },
        {
            "rule_id": "hr_joining_bonus_recovery",
            "domain": "Workplace",
            "topic": "Bond",
            "summary": "Joining bonus recovery is valid only under certain conditions.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Contract must clearly state joining bonus is repayable if you leave within X period.",
                "Recovery must be proportionate (if you stay 1 year of 2-year bond, 50% recovery is fair)."
            ],
            "exceptions": [
                "If company fires you, they cannot recover joining bonus.",
                "If you complete the minimum tenure mentioned, no recovery."
            ],
            "simple_explanation": "If your offer letter mentions joining bonus must be returned if you leave within a certain period, the company can recover it. However, recovery should be proportionate to time served.",
            "detailed_explanation": "Joining bonus with repayment clause is legally valid if clearly communicated upfront. However, full recovery regardless of time served may be deemed punitive. Courts favor proportionate recovery.",
            "examples": [
                "You got â‚¹2L joining bonus, contract says repay if leaving within 2 years. You leave after 1 year.",
                "Company wants full joining bonus back even though you stayed 22 months of 24-month bond."
            ],
            "what_to_say": "I understand the joining bonus is repayable. Can we discuss a proportionate settlement based on the time I've served?",
            "next_steps": [
                "ðŸ“„ Review offer letter - Check exact wording about joining bonus repayment terms.",
                "ðŸ§® Calculate proportionate - If you completed significant tenure, propose proportionate repayment.",
                "ðŸ’¬ Negotiate with HR - Most companies are open to negotiation rather than full recovery.",
                "ðŸ“§ Propose settlement - Send written proposal for partial repayment based on time served.",
                "âš–ï¸ Know your rights - Disproportionate penalties may be challengeable in court.",
                "ðŸ’° Check last settlement - They may deduct from final settlement; ensure calculation is correct.",
                "ðŸ“‹ Get settlement letter - Before paying, get written confirmation that all dues are settled.",
                "ðŸŽ¯ Consider timing - If repayment is large, negotiate payment plan over few months."
            ],
            "source_category": "Employment Contract / Indian Contract Act"
        },
        {
            "rule_id": "hr_non_compete_enforcement",
            "domain": "Workplace",
            "topic": "Resignation",
            "summary": "Non-compete clauses are largely unenforceable in India.",
            "verdict": "CANNOT",
            "conditions": [
                "Section 27 of Indian Contract Act makes restraint of trade void.",
                "Post-employment restrictions on working for competitors are generally not enforceable."
            ],
            "exceptions": [
                "Non-disclosure of confidential information is enforceable.",
                "During employment, exclusivity can be enforced.",
                "Very limited restrictions (not joining direct competitor for 3-6 months with garden leave) might be upheld."
            ],
            "simple_explanation": "In India, non-compete clauses that prevent you from working in your field after leaving a company are mostly unenforceable. You have the right to earn a livelihood.",
            "detailed_explanation": "Indian courts consistently hold that absolute non-compete clauses violate constitutional right to profession (Article 19(1)(g)). Only reasonable restrictions during employment or with paid garden leave may be valid.",
            "examples": [
                "Contract says 'cannot join any tech company for 2 years after resignation'.",
                "Ex-employer threatens legal action for joining competitor."
            ],
            "what_to_say": "I understand the concern about confidential information, which I will not disclose. However, the non-compete clause restricting my right to work is not enforceable under Indian law.",
            "next_steps": [
                "ðŸ“„ Review non-compete clause - Check exact wording and scope of restriction.",
                "âš–ï¸ Know the law - Section 27 of Indian Contract Act makes restraint of trade agreements void.",
                "ðŸ“§ Respond if threatened - Politely state you're aware of your legal rights.",
                "ðŸ¤ Maintain confidentiality - Don't share or use confidential information from previous employer.",
                "ðŸ’¼ Join new employer - Most non-compete clauses are not enforced; proceed with new job.",
                "ðŸ“‹ Keep documentation - Save all communications in case of legal threats.",
                "ðŸ—£ï¸ Consult lawyer if sued - If ex-employer files case, consult employment lawyer (they usually lose).",
                "ðŸ’¬ Inform new employer - Tell new company about non-compete so they're aware and can support you."
            ],
            "source_category": "Indian Contract Act Section 27 / Article 19(1)(g)"
        },
        {
            "rule_id": "hr_weekend_work_mandatory",
            "domain": "Workplace",
            "topic": "Overtime",
            "summary": "Weekend work depends on contract and industry norms.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "If contract mentions fixed weekdays + weekend availability, employer can ask for weekend work.",
                "Must provide compensatory offs or overtime pay as per law.",
                "Cannot make it mandatory beyond contracted hours without compensation."
            ],
            "exceptions": [
                "Emergency situations (production deadline, client emergency).",
                "If you're in senior management/client-facing role with such expectations."
            ],
            "simple_explanation": "Whether you must work weekends depends on your work contract and industry. However, if asked to work beyond contracted hours, you should get compensatory offs or overtime pay.",
            "detailed_explanation": "Shops & Establishments Act typically mandates one weekly off. If employer requires weekend work, they must provide alternate off or overtime compensation as per employment terms and applicable laws.",
            "examples": [
                "Manager expects you to work every Saturday without any comp-off.",
                "Contract says 5-day week but boss schedules meetings on Sundays regularly."
            ],
            "what_to_say": "I'm willing to support weekend work when needed. Can we discuss compensatory offs or overtime pay for this additional time?",
            "next_steps": [
                "ðŸ“„ Check your contract - See if it mentions weekly offs, working days, or weekend availability.",
                "ðŸ“§ Clarify expectations - Ask manager to specify if weekend work is one-time emergency or regular expectation.",
                "ðŸ“‹ Track weekend work - Maintain log of all weekend hours worked.",
                "ðŸ’° Request compensation - Ask for comp-off within same week or overtime pay per company policy.",
                "âš–ï¸ Know your rights - Shops Act mandates at least one weekly off (some states specify Sunday).",
                "ðŸ’¬ Escalate if exploited - If weekends become routine without compensation, raise with HR.",
                "ðŸŽ¯ Set boundaries - Politely establish availability (e.g., 'I can work one weekend/month with advance notice').",
                "ðŸ’¼ Evaluate culture - Regular unpaid weekend work may indicate poor work culture; consider if this is sustainable."
            ],
            "source_category": "Shops & Establishments Act / Employment Terms"
        },
        {
            "rule_id": "college_internal_marks_dispute",
            "domain": "College",
            "topic": "Documents",
            "summary": "Internal assessment must be fair and based on announced criteria.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "College must announce internal assessment criteria at start of semester.",
                "Marks should be based on actual performance, not favoritism.",
                "You have right to see evaluated answer sheets/presentations."
            ],
            "exceptions": [
                "If genuinely absent for tests/submissions without valid reason.",
                "If caught copying/plagiarism during internal assessment."
            ],
            "simple_explanation": "Internal marks should be awarded fairly based on pre-announced criteria. If you feel marks are unfair or given due to favoritism, you can challenge them by showing your work and requesting review.",
            "detailed_explanation": "University ordinances mandate transparent internal assessment. Arbitrary marking, favoritism, or not following announced criteria can be challenged through college/university grievance channels.",
            "examples": [
                "You scored well in all tests but professor gives you low internal marks without explanation.",
                "Teacher gives full marks to favorite students despite poor performance, low marks to you."
            ],
            "what_to_say": "I would like to review my internal assessment marks and understand the evaluation criteria. Can I see my evaluated papers/assignments?",
            "next_steps": [
                "ðŸ“„ Request mark sheets - Ask faculty/department for detailed breakup of internal marks.",
                "ðŸ“‹ Check announced criteria - Refer to course syllabus/handbook for internal assessment weightage.",
                "ðŸ‘ï¸ Review your work - Ask to see evaluated answer sheets, assignments, presentation scores.",
                "ðŸ’¬ Meet faculty - Schedule meeting with concerned teacher to understand scoring rationale.",
                "ðŸ“§ Escalate to HOD - If teacher doesn't respond, raise concern with Head of Department.",
                "ðŸ“ File formal complaint - Submit written complaint to Dean/Principal with evidence.",
                "âš–ï¸ University grievance - Approach university's Student Grievance Cell if college doesn't respond.",
                "ðŸ“Š Gather evidence - Collect your assignments, test papers, attendance to show your actual performance."
            ],
            "source_category": "University Ordinances / Academic Regulations"
        },
        {
            "rule_id": "college_hostel_fee_excess",
            "domain": "College",
            "topic": "Fees",
            "summary": "Hostel fees must be reasonable and only for actual facilities provided.",
            "verdict": "CANNOT",
            "conditions": [
                "Fees should match facilities provided (room, mess, utilities).",
                "Cannot charge arbitrary or excessive amounts beyond actual costs.",
                "Fee structure should be transparent and announced beforehand."
            ],
            "exceptions": [
                "Fees can be increased with proper justification (inflation, facility upgrade).",
                "Special facilities (AC rooms, single occupancy) cost more."
            ],
            "simple_explanation": "Hostel fees should be reasonable and transparent. Colleges cannot charge excessive amounts or hide fees. You have right to know what you're paying for.",
            "detailed_explanation": "UGC/AICTE guidelines require fee transparency. Hostel fees must be justified by actual amenities. Arbitrary or hidden charges can be challenged.",
            "examples": [
                "College charges â‚¹1.5L hostel fee but provides poor food, no hot water.",
                "Hidden charges appear at payment time not mentioned in prospectus."
            ],
            "what_to_say": "Can you provide detailed breakup of hostel fees showing what each charge covers? This seems higher than comparable hostels.",
            "next_steps": [
                "ðŸ“„ Request fee breakup - Ask hostel administration for itemized fee structure (room rent, mess, electricity, etc.).",
                "ðŸ“‹ Compare with others - Research hostel fees at similar colleges in your city/region.",
                "ðŸ’¬ Raise concern - Discuss with hostel warden/administration about excessive fees.",
                "ðŸ“§ Written complaint - Submit complaint to college principal with comparison data.",
                "ðŸ›ï¸ Escalate to university - If college doesn't respond, complain to affiliated university.",
                "ðŸ“ž Call UGC - Report to UGC helpline 1800-111-656 for excessive fee charging.",
                "âš–ï¸ Consumer forum - Hostel services fall under consumer protection; can file complaint.",
                "ðŸ¤ Collective action - Form hostel committee with other students to negotiate fee reduction."
            ],
            "source_category": "UGC Guidelines / Consumer Protection"
        },
        {
            "rule_id": "college_scholarship_delay",
            "domain": "College",
            "topic": "Fees",
            "summary": "Colleges must process scholarships timely and cannot deny eligible students.",
            "verdict": "CANNOT",
            "conditions": [
                "If you meet scholarship criteria, college must forward your application.",
                "Cannot delay or block scholarship processing for their benefit."
            ],
            "exceptions": [
                "If you don't meet eligibility criteria (marks, income, category).",
                "If required documents are incomplete."
            ],
            "simple_explanation": "If you're eligible for government scholarship, your college cannot delay or block your application. They must process it and release funds to you once received.",
            "detailed_explanation": "Government scholarships are students' entitlements. Colleges delaying processing or misusing scholarship funds face serious penalties. Students can directly complain to scholarship portal/district authorities.",
            "examples": [
                "You applied for SC/ST scholarship 6 months ago, college hasn't forwarded it.",
                "College receives scholarship amount but doesn't credit it to your account."
            ],
            "what_to_say": "I am eligible for [scholarship name] and submitted all documents. Please share the status and when the application will be forwarded.",
            "next_steps": [
                "ðŸ“± Check scholarship portal - Login to National Scholarship Portal/state portal to see application status.",
                "ðŸ“‹ Verify eligibility - Confirm you meet all criteria (income, marks, category, course).",
                "ðŸ“„ Collect acknowledgment - Ensure college gave you receipt/acknowledgment of scholarship application.",
                "ðŸ“§ Email college - Send formal request to scholarship cell/accounts office for status update.",
                "ðŸ“ž Call scholarship helpline - Each scholarship has helpline number; call to inquire about your application.",
                "ðŸ›ï¸ Escalate to district office - If college delays, approach District Social Welfare Office directly.",
                "âš–ï¸ File RTI - Use RTI to ask college on what date they forwarded your scholarship application.",
                "ðŸ“ Complaint to portal - Most scholarship portals have grievance section to report college delays."
            ],
            "source_category": "Scholarship Schemes / UGC Guidelines"
        },
        {
            "rule_id": "college_exam_schedule_sudden_change",
            "domain": "College",
            "topic": "Attendance",
            "summary": "Universities cannot suddenly change exam dates without reasonable notice.",
            "verdict": "CANNOT",
            "conditions": [
                "Exam schedule changes must be notified at least 15-30 days in advance.",
                "Changes should only be for valid reasons (emergency, technical issues)."
            ],
            "exceptions": [
                "Natural disasters, pandemic, force majeure situations.",
                "Paper leak or exam malpractice requiring rescheduling."
            ],
            "simple_explanation": "Universities should give adequate notice before changing exam dates. Last-minute changes (within a week) without serious reason are unfair and can be challenged.",
            "detailed_explanation": "University examination ordinances typically mandate minimum notice period for schedule changes. Abrupt changes affecting student preparation can be challenged through university grievance mechanisms.",
            "examples": [
                "Exam scheduled for June 15 is suddenly moved to June 8 with only 4 days notice.",
                "Datesheet changed for convenience without considering student preparation."
            ],
            "what_to_say": "This sudden change gives us insufficient preparation time. Can the university reconsider or provide valid justification for the change?",
            "next_steps": [
                "ðŸ“§ Check official notice - Verify the schedule change on university official website/notice board.",
                "ðŸ“‹ Understand reason - Find out why the change was made (emergency vs administrative convenience).",
                "ðŸ—£ï¸ Collective representation - Form student committee to approach university administration together.",
                "ðŸ“ Submit representation - Written petition signed by multiple students requesting reconsideration.",
                "ðŸ“ž Contact Controller of Exams - Call/email university examination department for clarification.",
                "âš–ï¸ Know your rights - University ordinances usually mandate minimum 15-day notice for changes.",
                "ðŸ›ï¸ Approach Student Union - Get student union/council to represent the concern officially.",
                "ðŸ“± Social media pressure - Tweet at university handle (professionally) to create awareness."
            ],
            "source_category": "University Examination Ordinances"
        },
        {
            "rule_id": "college_dress_code_unreasonable",
            "domain": "College",
            "topic": "Ragging",
            "summary": "College dress codes must be reasonable and non-discriminatory.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Dress codes for professional courses (medical, hospitality) are acceptable.",
                "Rules should be uniform for all genders and not target specific communities.",
                "Cannot enforce personal grooming choices (hair length, facial hair beyond basic neatness)."
            ],
            "exceptions": [
                "Uniforms in schools/professional colleges are generally valid.",
                "Lab safety requirements (closed shoes, tied hair)."
            ],
            "simple_explanation": "Colleges can have dress codes for valid reasons (safety, professional training), but they cannot be arbitrary, discriminatory, or violate personal freedom without justification.",
            "detailed_explanation": "While educational institutions have some authority to enforce dress codes, unreasonable restrictions that discriminate based on gender, religion, or violate fundamental rights can be challenged in court.",
            "examples": [
                "College bans jeans for girls but allows for boys.",
                "Mandatory dress code for general degree college without professional justification."
            ],
            "what_to_say": "I understand maintaining decorum, but this dress code seems discriminatory/unreasonable. Can the college provide justification?",
            "next_steps": [
                "ðŸ“„ Review college rules - Check if dress code is mentioned in college prospectus/handbook.",
                "ðŸ“‹ Document discrimination - If rule is gender-specific or targets certain groups, collect evidence.",
                "ðŸ’¬ Raise with principal - Submit representation explaining why the code is unreasonable.",
                "ðŸ¤ Collective petition - Get multiple students to sign petition against unfair dress code.",
                "ðŸ“§ Approach college committee - Present concern at college council or student grievance committee.",
                "âš–ï¸ Legal opinion - Discriminatory dress codes can be challenged as violating Article 14 (equality), 19 (freedom), 21 (dignity).",
                "ðŸ›ï¸ Approach university - If college affiliated to university, complain to university authorities.",
                "ðŸ“± Public awareness - Last resort: media/social media to highlight unreasonable restrictions (use responsibly)."
            ],
            "source_category": "Fundamental Rights / University Regulations"
        },
        {
            "rule_id": "college_library_access_restriction",
            "domain": "College",
            "topic": "Documents",
            "summary": "College cannot arbitrarily deny library or facility access to students.",
            "verdict": "CANNOT",
            "conditions": [
                "As enrolled student, you have right to use college facilities including library, labs, sports.",
                "Can only be restricted for disciplinary reasons after proper inquiry."
            ],
            "exceptions": [
                "Temporary restriction during exams for non-exam students.",
                "Fee dues may limit some facilities (but not academic resources like library)."
            ],
            "simple_explanation": "Once you're admitted and paying fees, you have right to use college facilities. College cannot randomly ban you from library, lab, or sports without valid disciplinary reason and proper process.",
            "detailed_explanation": "Educational facilities are part of what students pay for. Arbitrary denial violates contractual obligation and right to education. Even fee defaulters cannot be denied academic facilities as per UGC.",
            "examples": [
                "Librarian bans you because you argued with them once.",
                "College blocks lab access saying 'too many students today'."
            ],
            "what_to_say": "As an enrolled student, I have the right to access college facilities. Please provide the reason for this restriction and the process to resolve it.",
            "next_steps": [
                "ðŸ“§ Request written reason - Ask college administration for formal explanation of access denial.",
                "ðŸ“‹ Check college rules - Review what student handbook says about facility access rights.",
                "ðŸ’¬ Meet concerned authority - Speak with librarian/lab in-charge/dean to understand issue.",
                "ðŸ“ Written complaint - Submit complaint to principal if restriction seems arbitrary.",
                "ðŸ“„ Show fee receipts - Prove you've paid fees and are entitled to facilities.",
                "âš–ï¸ Know your rights - UGC mandates that admitted students must have access to learning resources.",
                "ðŸ›ï¸ University grievance - Escalate to university if college doesn't resolve quickly.",
                "ðŸ¤ Collective pressure - If affecting multiple students, represent together for faster resolution."
            ],
            "source_category": "UGC Guidelines / Student Rights"
        },
        {
            "rule_id": "consumer_online_return_denial",
            "domain": "Documents",
            "topic": "Shopping",
            "summary": "E-commerce sites must accept returns for defective/wrong products.",
            "verdict": "CANNOT",
            "conditions": [
                "For defective, damaged, or wrong items, return must be accepted.",
                "Return window is typically 7-30 days as per website policy.",
                "Product should be unused with tags for non-defective returns."
            ],
            "exceptions": [
                "Innerwear, cosmetics, grocery items usually not returnable for hygiene reasons.",
                "Custom-made or personalized items."
            ],
            "simple_explanation": "If you receive a defective, damaged, or wrong product, the seller must accept return and refund. For non-defective items, return depends on the site's policy, but defective items must always be returnable.",
            "detailed_explanation": "Consumer Protection Act covers e-commerce. Sellers cannot deny returns for defective products. Platform is also liable. However, 'change of mind' returns depend on seller's stated policy.",
            "examples": [
                "Received broken phone, seller says 'courier damaged, not our fault'.",
                "Wrong size delivered, seller refuses return saying 'final sale'."
            ],
            "what_to_say": "This product is defective/wrong as per order. As per Consumer Protection Act, I'm entitled to return/refund. Please arrange reverse pickup.",
            "next_steps": [
                "ðŸ“¸ Photo/video evidence - Unbox on camera showing defect/damage/wrong item.",
                "ðŸ“§ Raise complaint immediately - Use app/website to file return request within return window.",
                "ðŸ“‹ Choose correct reason - Select 'defective', 'damaged', or 'wrong item' in return form.",
                "ðŸ“ž Call customer care - Speak to support if online return request is rejected.",
                "ðŸ’¬ Email escalation - Send detailed complaint to seller's escalation email with evidence.",
                "âš–ï¸ Consumer complaint - File at National Consumer Helpline 1800-11-4000 or consumerhelpline.gov.in.",
                "ðŸ“± Social media - Tag brand/platform on Twitter/Facebook (often faster resolution).",
                "ðŸ›ï¸ Consumer forum - For higher value items, file case at district consumer disputes forum."
            ],
            "source_category": "Consumer Protection Act, 2019 / E-commerce Rules"
        },
        {
            "rule_id": "consumer_credit_card_fraud",
            "domain": "Documents",
            "topic": "Consumer",
            "summary": "Banks must reverse unauthorized credit card transactions.",
            "verdict": "CANNOT",
            "conditions": [
                "Report fraud within 3 days for zero liability.",
                "Bank must investigate and reverse if fraud is proven.",
                "You must not have shared OTP/PIN/CVV willingly."
            ],
            "exceptions": [
                "If you shared credentials knowingly, bank may not reverse.",
                "Report delay beyond 7 days may complicate claim."
            ],
            "simple_explanation": "If your credit card is used fraudulently without your knowledge, report immediately to bank. They must reverse unauthorized transactions. But don't share OTP/CVV with anyone.",
            "detailed_explanation": "RBI guidelines mandate zero liability for customers who report fraud promptly. Banks cannot hold customer liable for unauthorized transactions unless customer was negligent or shared credentials.",
            "examples": [
                "Unknown transaction of â‚¹25,000 appears on credit card statement.",
                "Card was with you, but online transaction happened from different city."
            ],
            "what_to_say": "I notice unauthorized transactions on my card. I did not make these transactions and did not share any credentials. Please block my card immediately and reverse these charges.",
            "next_steps": [
                "ðŸ“ž Call bank immediately - Contact customer care and block card right away (within hours of noticing fraud).",
                "ðŸ“§ Email/SMS report - Send written complaint to bank's fraud/disputes email with transaction details.",
                "ðŸ“‹ File FIR - Go to cybercrime police station and file FIR (bank may request this).",
                "ðŸ’³ Request new card - Ask bank to issue replacement card with new number.",
                "ðŸ“ Dispute transactions - Fill formal transaction dispute form with bank within 3 days.",
                "ðŸ“„ Document everything - Save all communications, transaction alerts, bank responses.",
                "âš–ï¸ Escalate to Banking Ombudsman - If bank delays beyond 30 days, complain at rbi.org.in.",
                "ðŸ”’ Enable alerts - Set up SMS/email alerts for all transactions to catch fraud early next time."
            ],
            "source_category": "RBI Guidelines / Payment Systems"
        },
        {
            "rule_id": "consumer_insurance_claim_rejection",
            "domain": "Documents",
            "topic": "Consumer",
            "summary": "Insurance companies must give valid reasons for claim rejection.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Rejection must be based on policy terms, not arbitrary.",
                "Company must provide written reason within specified time (typically 30 days).",
                "Cannot reject for minor documentation issues without giving chance to rectify."
            ],
            "exceptions": [
                "Genuine policy exclusions (pre-existing disease, claim within waiting period).",
                "Fraud or misrepresentation in application."
            ],
            "simple_explanation": "Insurance companies can reject claims if there's valid policy-based reason, but they must explain in writing. Random rejections or rejecting for minor paperwork issues without allowing correction are unfair.",
            "detailed_explanation": "IRDAI regulations mandate insurers follow due process in claim settlement. Rejection without proper investigation or valid grounds can be challenged with Insurance Ombudsman who can order payment with interest.",
            "examples": [
                "Health insurance rejects claim saying 'medical documents unclear' without specifying what's needed.",
                "Car insurance denies accident claim without proper investigation."
            ],
            "what_to_say": "I need detailed written explanation for this claim rejection with specific policy clause references. If documents are insufficient, please specify what additional proof you need.",
            "next_steps": [
                "ðŸ“§ Request rejection letter - Ask for formal written communication stating exact reason for rejection.",
                "ðŸ“‹ Review policy document - Check if rejection reason is actually mentioned in policy terms.",
                "ðŸ“„ Submit missing docs - If rejected for incomplete documents, submit whatever they're asking for.",
                "ðŸ’¬ Escalate within company - Write to insurer's grievance cell/escalation team.",
                "ðŸ“ž Call IRDAI helpline - Dial 155255 (Integrated Grievance Management System) to file complaint.",
                "âš–ï¸ Insurance Ombudsman - File complaint at bimabharosa.irdai.gov.in if not resolved in 30 days.",
                "ðŸ›ï¸ Consumer forum - Can also approach consumer disputes forum for insurance claim disputes.",
                "ðŸ’¼ Legal notice - For large claims, send lawyer's notice demanding settlement with policy reference."
            ],
            "source_category": "IRDAI Regulations / Insurance Act"
        },
        {
            "rule_id": "consumer_gym_membership_cancellation",
            "domain": "Documents",
            "topic": "Contract",
            "summary": "Gym membership cancellation rules must be reasonable.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Gym can have notice period (30-60 days) for cancellation.",
                "Cannot keep entire year's fees if you want to exit mid-year with valid reason.",
                "Medical reasons, relocation should allow proportionate refund."
            ],
            "exceptions": [
                "If you signed contract with clear '12-month lock-in, no refund' clause.",
                "If gym provided significant upfront benefits (3 months free, etc.)."
            ],
            "simple_explanation": "Gym contracts can have terms, but they should be reasonable. If you have genuine reason (relocation, medical issue), you should get refund for unused period. Unfair penalty clauses can be challenged.",
            "detailed_explanation": "Consumer Protection Act regulates unfair trade practices. Absolute 'no refund' policies for services not received are often held invalid. Courts favor proportionate refund for genuine reasons.",
            "examples": [
                "You paid â‚¹20K for annual membership, relocating for job after 3 months, gym refuses any refund.",
                "Doctor advises you can't exercise, gym says 'no medical cancellation'."
            ],
            "what_to_say": "I have a genuine reason [relocation/medical] for canceling membership. I request a proportionate refund for the unused period as per consumer rights.",
            "next_steps": [
                "ðŸ“„ Review contract - Check what cancellation policy was mentioned in membership agreement.",
                "ðŸ“‹ Gather proof - Medical certificate, job transfer letter, or other evidence for cancellation reason.",
                "ðŸ“§ Written cancellation request - Email gym management with formal cancellation notice and reason.",
                "ðŸ’¬ Negotiate refund - Propose fair settlement (refund 50-70% of unused period amount).",
                "ðŸ“ž Call corporate office - If local gym doesn't cooperate, escalate to chain's head office.",
                "âš–ï¸ Consumer complaint - File at consumer forum citing unfair trade practice.",
                "ðŸ’³ Credit card dispute - If paid by card, can raise dispute with card issuer for services not received.",
                "ðŸ—£ï¸ Social media - Post review on Google/social media (factually) to pressure resolution."
            ],
            "source_category": "Consumer Protection Act / Contract Law"
        },
        {
            "rule_id": "consumer_mobile_network_poor",
            "domain": "Documents",
            "topic": "Consumer",
            "summary": "Telecom operators must provide quality service or allow termination without penalty.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "If service is consistently poor despite complaints, you can terminate without penalty.",
                "Operator must investigate complaints within specified time (typically 7 days)."
            ],
            "exceptions": [
                "Temporary service issues due to natural disasters, maintenance.",
                "If you're in location with disclosed poor coverage."
            ],
            "simple_explanation": "If your mobile network is consistently poor and operator doesn't fix it despite complaints, you have right to switch without paying cancellation charges for balance contract period.",
            "detailed_explanation": "TRAI Quality of Service standards mandate minimum performance. Persistent poor service allows customers to exit contract. Operators cannot charge penalty for their service failure.",
            "examples": [
                "Taking postpaid with 2-year contract, but network drops 10 times daily, company wants â‚¹5K to port out.",
                "Broadband speed is 1/10th of promised speed consistently."
            ],
            "what_to_say": "I have registered multiple complaints about poor service which remains unresolved. As per TRAI regulations, I should be allowed to terminate without penalty due to this service deficiency.",
            "next_steps": [
                "ðŸ“ž Register complaints - Call 198 (customer care) and register service complaint, note complaint numbers.",
                "ðŸ“§ Email complaints - Send written complaints to operator's nodal officer email.",
                "ðŸ“‹ Document issues - Keep speed test screenshots, call drop records, complaint reference numbers.",
                "â° Give resolution time - Allow 7 days for operator to resolve as per TRAI norms.",
                "ðŸ“± Request termination - After repeated failures, request contract termination citing service deficiency.",
                "âš–ï¸ TRAI complaint - File complaint at consumerhelpline.trai.gov.in or call 1800-110-420.",
                "ðŸ’¬ Escalate to Appellate Authority - If not resolved in 30 days, escalate within TRAI.",
                "ðŸ›ï¸ Consumer forum - Can file case for deficiency of service + compensation."
            ],
            "source_category": "TRAI Regulations / Consumer Protection"
        },
        {
            "rule_id": "consumer_electricity_bill_excessive",
            "domain": "Documents",
            "topic": "Consumer",
            "summary": "Electricity companies must justify bill amounts and allow disputes.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Bill should match actual meter reading.",
                "Cannot charge estimated/average bill for more than 2 consecutive months.",
                "Must investigate dispute within 7 days."
            ],
            "exceptions": [
                "If you tampered with meter or stole electricity.",
                "Bill adjustment for previous under-billing periods."
            ],
            "simple_explanation": "Your electricity bill should be based on actual meter reading, not random estimates. If bill is abnormally high, you can demand meter check and dispute resolution.",
            "detailed_explanation": "Electricity Act and State Electricity Regulatory Commission rules mandate billing based on actual reading, dispute resolution mechanism, and limits on estimated billing.",
            "examples": [
                "Bill is â‚¹15,000 when your usage is typically â‚¹2,000.",
                "Company sends estimated bills for 6 months straight without meter reading."
            ],
            "what_to_say": "This bill amount is abnormally high compared to my usual consumption. Please send technician to check meter and review the billing. I'm filing a dispute.",
            "next_steps": [
                "ðŸ“Š Compare previous bills - Check last 6 months bills to see if current is anomaly.",
                "ðŸ“„ Check meter reading - Verify meter reading shown on bill matches your actual meter.",
                "ðŸ“ž Call customer care - Register complaint about high bill/wrong reading immediately.",
                "ðŸ“§ Email grievance cell - Send written complaint to electricity board's consumer grievance email.",
                "ðŸ‘¨â€ðŸ”§ Request meter inspection - Ask for meter testing (often free or refundable if meter is faulty).",
                "âš–ï¸ Know your rights - Most states allow payment of only average of last 6 months during dispute period.",
                "ðŸ›ï¸ Approach Ombudsman - Each state has Electricity Ombudsman; file complaint after company response.",
                "ðŸ’¡ Temporary relief - Request installment payment plan while dispute is being investigated."
            ],
            "source_category": "Electricity Act / State Regulatory Commission"
        },
        {
            "rule_id": "consumer_restaurant_service_charge",
            "domain": "Documents",
            "topic": "Consumer",
            "summary": "Service charge in restaurants is voluntary, not mandatory.",
            "verdict": "CANNOT",
            "conditions": [
                "Restaurants cannot force you to pay service charge.",
                "Must be clearly mentioned as optional/voluntary if added to bill.",
                "Different from government taxes which are mandatory."
            ],
            "exceptions": [
                "If menu/entrance clearly states 'Service charge applicable'.",
                "For large groups/events, advance notice of service charge is acceptable."
            ],
            "simple_explanation": "Service charge (typically 5-10%) on restaurant bills is voluntary. You can refuse to pay it. Only government GST is mandatory. Restaurants cannot force or threaten you to pay service charge.",
            "detailed_explanation": "As per CCPA (Central Consumer Protection Authority) guidelines 2017, service charge is voluntary. Restaurants collecting it forcibly are violating consumer rights. Only taxes are mandatory.",
            "examples": [
                "Bill has '10% service charge' added, waiter insists it's mandatory.",
                "Restaurant manager threatens to not let you leave unless you pay service charge."
            ],
            "what_to_say": "As per government guidelines, service charge is voluntary. I will pay for the food and applicable GST, but I choose not to pay the service charge.",
            "next_steps": [
                "ðŸ“‹ Check bill carefully - Identify service charge vs government taxes (GST).",
                "ðŸ’¬ Politely inform staff - Say 'I'd like the bill without service charge please'.",
                "ðŸ“± Show guideline if needed - Can show CCPA notification on phone to manager.",
                "ðŸ’° Pay for food + GST only - Refuse service charge; it's your legal right.",
                "ðŸ“¸ Document if harassed - If restaurant threatens or misbehaves, record/take photo of bill.",
                "ðŸ“ž Call police if forced - Forceful retention is illegal confinement; dial 100.",
                "âš–ï¸ File consumer complaint - Report restaurant to National Consumer Helpline 1800-11-4000.",
                "ðŸ—£ï¸ Social media/review - Post about the experience to warn others (stick to facts)."
            ],
            "source_category": "CCPA Guidelines / Consumer Protection Act"
        },
        {
            "rule_id": "consumer_hotel_booking_cancellation",
            "domain": "Documents",
            "topic": "Shopping",
            "summary": "Hotel cancellation charges must be reasonable and declared upfront.",
            "verdict": "CONDITIONAL",
            "conditions": [
                "Cancellation policy must be clearly shown before booking.",
                "Charges should be proportionate (free cancellation up to 24-48 hours before check-in is standard).",
                "Cannot charge 100% for cancellation made weeks in advance."
            ],
            "exceptions": [
                "Peak season/events bookings may have stricter cancellation terms.",
                "Non-refundable discount bookings clearly marked as such."
            ],
            "simple_explanation": "Hotels can have cancellation charges, but they must be reasonable and clearly stated when you book. Charging full amount for early cancellation or having hidden cancellation terms is unfair.",
            "detailed_explanation": "Consumer Protection Act requires transparency in cancellation policies. Disproportionate penalties or policies not disclosed clearly can be challenged as unfair trade practice.",
            "examples": [
                "You cancel 2 weeks before check-in, hotel keeps 100% payment.",
                "Cancellation policy was not shown during booking, hotel now says 'non-refundable'."
            ],
            "what_to_say": "The cancellation policy was not clearly disclosed/charges seem disproportionate. I should get reasonable refund as I canceled well in advance.",
            "next_steps": [
                "ðŸ“§ Check confirmation email - Review booking confirmation for stated cancellation policy.",
                "ðŸ“± Screenshot booking page - Capture what was shown at time of booking if policy wasn't clear.",
                "ðŸ“ž Call hotel directly - Sometimes booking platforms are stricter; calling hotel may allow more flexible cancellation.",
                "ðŸ’¬ Request manager - Explain your situation (emergency, travel restrictions) and request waiver.",
                "ðŸ“„ Provide reason - Medical emergency, job loss, government restrictions often get sympathetic hearing.",
                "âš–ï¸ Booking platform support - If booked via OTA, raise dispute with MakeMyTrip/Goibibo/Booking.com.",
                "ðŸ›ï¸ Consumer complaint - File complaint for unfair trade practice if policy was not disclosed or charges unreasonable.",
                "ðŸ’³ Credit card dispute - As last resort, can raise chargeback with card issuer for services not received."
            ],
            "source_category": "Consumer Protection Act / Hospitality Industry Standards"
        }
    ]
}